[
    {
        "uri": "/_index",
        "content": "---\ntitle: \"Recipes\"\ndate: 2022-01-09T11:15:29+01:00\ndraft: false\nweight: 130\n---\n",
        "tags": []
    },
    {
        "uri": "/2012-01-21-turkey-steaks-with-cream-sauce-and-cabbage-rice",
        "title": "Turkey Steaks with Cream Sauce and Cabbage Rice",
        "content": "div class=\"description\" hidden\r\nThis is a very simple meal but very tasty. I sometimes make the turkey steaks during the week with broccoli or some other vegetable, but because today is Saturday let's load up on carbs! No source for the recipe. It's just one of those things that I have eaten all my life. My mum actually makes this rice for special occasions because it's incredibly tasty.\r\n/div\r\n\r\n\r\n\r\nh3Ingredients (span class=\"yield\"2 servings/span)/h3\r\n\r\nuTurkey Steaks/u\r\r\n\r\n400g turkey steaks (3 steaks)\r\r\n200g fresh mushrooms (or 1/2lb)\r\r\n125mL cooking cream (8% fat) (or 1/2cup)\r\r\n6 garlic cloves\r\r\nolive oil, salt, ground pepper, q.s.\r\r\n\r\n\r\nuRice/u\r\r\n\r\n\"250mL coffee mug\" rice (or 1 cup)\r\r\n500mL water (or 2 cups)\r\r\n1 medium onion\r\r\n100g diced bacon (or 1/4lb)\r\r\n1/2 cabbage\r\r\n1/2 Chicken Bouillon (or 250mL/1cup of chicken stock and 250mL/1cup of water)\r\r\nolive oil, salt q.s.\r\r\n\r\nInstructions\r\r\n\r\nuFor the rice:/u\r\n\r\nStart by heating a pan where you will cook the rice in medium+ heat. While the pan is heating chop your onion in small pieces. Add some olive oil to your pan (enough to cover the bottom of your pan), add the chopped onion and reduce the temperature to medium. While the onion is frying, chop the garlic finely for the steaks. \r\r\n\r\n\r\r\n\r\r\n  \r\r\n\r\r\nWhen the onion starts to look translucent add the diced bacon and let it fry for a few minutes until the bacon is cooked. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\nChop the cabbage into small stripes. By now the bacon should be cooked. Add the rice and mix frequently for about 3 minutes. Add the water, the cabbage, the chicken bouillon and season with a bit of salt (you might want to taste it before adding more salt). Put a lid on the pan and let simmer until almost all the water as evaporated. You can take off the lid when there's only a bit of water and turn off the heat. (This will ensure that the rice remains moist and loose).\r  \r\n  \r\nuFor the steaks:/u\r\n\r\nHeat the pan where you will cook your steaks in medium- and add olive oil (enough to cover 2/3 of your pan), the garlic and the mushrooms. By adding everything at the same time you will ensure that the garlic won't burn. Season the mushrooms with a bit of salt (or soy sauce) and ground pepper. \r\r\n\r\n\r\r\n\r\nThe mushrooms will release a lot of water. \r\r\n\r\n\r\r\n\r\nWhen they have released all the water and the pan is almost dry add your steaks. Season the steaks on the pan with salt and pepper. Turn them when necessary. \r\n\r\nTo check if they're done I use a trick: with your left hand, hold your thumb with your other four fingers. with the index finger of your right hand check the consistency of the space between your index finger and your thumb of your left hand. Now with the index finger of your right hand touch your steak. if the consistency is similar your steak is medium done. After a while you'll know if your steaks are done just be touching them with a fork or spatula.\r\n\r\nIf the pan gets too dry you can add a little water or white wine (just enough to cover the bottom of the pan). \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nWhen the steaks are done, reduce the temperature and add the cream. Scrap the bottom of your pan so that the garlic that might have gotten stuck can stay in your sauce and give it color. Let the cream cook for 2-3 minutes and you're done!  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n",
        "tags": [
            "rice",
            "portuguese",
            "cabbage",
            "turkey"
        ]
    },
    {
        "uri": "/2012-01-24-chickpeas-salad",
        "title": "Chickpeas Salad",
        "content": "div class=\"description\" hidden\r\nWhen you don't have time or patience to come up with something to cook this recipe is probably the answer to your problems. Super easy to make and it only takes the time that the eggs need do cook. And I don't know about you, but I always have these ingredients in my pantry. Win win win.  \r\r\n/div\r\n\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"3 servings/span)/h3\r\n\r\n2 cans of chickpeas\r\r\n1 can of tuna in oil (140g or 5oz)\r\r\n1 small red onion\r\r\n2 eggs\r\r\nparsley, olive oil, vinegar, salt q.s.\r\r\n\r\nh3Instructions (Time: span class=\"duration\"20 minutes/span)/h3\r\n\r\r\nStart by boiling the eggs in salted water for fifteen minutes. While the eggs are boiling, drain the water of the chickpeas cans and try one chickpea. Sometimes I find that the chickpeas are under-cooked and boil them for a few minutes in salted water. But this time they were good. Add the chickpeas to a bowl. \r\r\n\r\n\r\r\n\r\nChop your onion and a bunch of parsley finely. Add the onion to the bowl.\r\r\n\r\n\r\r\n\r\nDrain the tuna of the oil and add it to the bowl. Add the parsley to the bowl and season your salad. \r\r\n\r\n\r\r\n\r\r\nRemember that you should have 1/3 of vinegar to olive oil. Season with salt to taste. Give it a try you can always add more vinegar, olive oil or salt. \r\r\n\r\r\nWhen the eggs are cooked peel them under cool running water. At this point you can either slice the eggs into small pieces and add them to your salad, or eat them separately with a little ground pepper. I prefer the latter. \r\r\n\r\r\nSo good! \r\n\r\n\r\n",
        "tags": [
            "chickpeas",
            "portuguese",
            "tuna"
        ]
    },
    {
        "uri": "/2012-01-28-saturdays-pancakes",
        "title": "Saturday's Pancakes",
        "content": "\r\ndiv class=\"description\" hidden\r\nThe best away to celebrate our day off is to start the day with our favorite breakfast: Pancakes! We've been eating pancakes on Saturdays ever since we moved to Denmark. It's easy to make and we never get tired of it. With some butter and maple syrup, a cup of coffee and orange juice... Saturdays are the best!  \r\r\n/div\r\n\r\n\r\r\n\r\n\r\nh3Ingredients (span class=\"yield\"2-3 servings/span)/h3\r\n\r\n1 egg\r\r\n250mL milk (or 1 cup)\r\r\n120g flour (1 cup)\r\r\n1 tablespoon granulated sugar\r\r\n1/3 teaspoon salt\r\r\n2 heaped teaspoons baking powder \r\r\n2 tablespoons vegetable oil or melted butter \r\r\nbutter and maple syrup to taste\r\r\n\r\r\n(Note: You can just use the same measuring instrument you used for the milk to measure the flour, even if you don't have a measuring cup. A coffee mug usually does the job. But I actually prefer to just measure the milk and keep adding flour until it reaches the right consistency.)\r\n\r\nh3Instructions (Time: span class=\"duration\"30 minutes/span)/h3\r\n\r\r\nI usually start with the wet ingredients.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nBreak one egg into the mixing bowl and add the milk. Beat with a whisk until the egg is well mixed with the milk.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nAdd the oil (or melted butter), the granulated sugar and the salt and beat just for a bit.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nIn the meanwhile, put your non-stick pan on the stove at medium+ temperature. Add the flour and the baking powder to the mixture and beat well.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nBy now, you should have a thick batter, but you can always adjust it by adding more flour or more milk. If you prefer lighter pancakes add more milk or if you prefer thicker pancakes add more flour. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nIf it's your first time making pancakes from scratch just keep to the recipe and leave the adjustments for the next time you make these. \r\r\n\r\r\nYour pan should be hot enough now. There's no need to add any kind of fat to the pan. Just pour a third of a ladle of batter in the center of the pan. After a little bit you'll start to see bubbles on your pancake. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nWhen these bubbles start to pop it's time to turn the pancake with a spatula. Your pancake should have a golden color. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\nWhen the sides of the pancake start to brown your pancake is ready!\r\n \r\nAnd now just add butter to taste while they're still warm and some maple syrup!  \r\r\n\r\n\r\n",
        "tags": [
            "saturday",
            "american"
        ]
    },
    {
        "uri": "/2012-01-31-mustard-pork-tenderloin",
        "title": "Mustard Pork Tenderloin",
        "content": "div class=\"description\" hidden\r\nAnd now a recipe from Pantagruel. It's called \"Lombo de porco assado com mostarda\".  \r\r\n\r\nAs per usual, there's no mention of the oven temperature or cooking time. But it worked out great! The mustard complements the pork quite well. And here is a picture from Pantagruel of the pork cuts for the cook that doesn't know them yet.\r\n\r\nimg src=\"/images/2012-01-31-mustard-pork-tenderloin-pork.jpg\" alt=\"mustard-pork-tenderloin1\"/\r\n\r\n/div\r\n\r\n\r\n\r\nh3Ingredients (span class=\"yield\"2-3 servings/span)/h3\r\n\r\n1 pork tenderloin (500g or 1lb)\r\r\n3 tablespoons Dijon mustard\r\r\n1 tablespoon vinegar\r\r\nsalt, white wine q.s.\r\r\n\r\nh3Instructions (Time: span class=\"duration\"1 hour/span)/h3\r\n\r\nPreheat your oven to 180ºC (350ºF). Find a snug-fitting pot for the pork tenderloin (I used a cake pan eheh). Rub the tenderloin with salt thoroughly and add a bit of olive oil or margarine if you feel that the tenderloin is too lean. \r\n\r\n\r\r\n\r\nCook the tenderloin in the preheated oven for 30-40 minutes. If the pot gets to dry add a bit of white wine.\r\r\n\r\nIn a small bowl mix the dijon mustard with the vinegar. \r\r\n\r\n\r\r\n\r\nWhen the tenderloin is almost done rub it with the mixture and cook it until done in the oven. \r\r\n\r\n\r\r\n\r\nSlice it in small pieces and serve with whatever you feel like. Since we ate it during the week I just boiled some broccoli. But I honestly can't think of something that wouldn't be a good side dish to accompany this tenderloin. \r\r\n\r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "portuguese",
            "pantagruel",
            "pork"
        ]
    },
    {
        "uri": "/2012-02-04-lemon-cookies",
        "title": "Lemon Cookies",
        "content": "div class=\"description\" hidden\r\nDesserts are my favorite things to cook. This recipe has turned out a great success every time I used it. It takes some time to finish but in the end is totally worth it. The husband loves these cookies. They keep well and make a great combo with coffee or tea. And it's another recipe from Pantagruel!\r\r\n/div\r\n\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"30 cookies/span)/h3\r\n\r\n1/2kg white flour (4 cups)\r\r\n200g granulated sugar (7oz)\r\r\n250g butter at room temperature (9oz)\r\r\n2 eggs\r\r\n1 small lemon\r\r\n\r\nh3Instructions (Time: span class=\"duration\"2 hours/span)/h3\r\n\r\nStart by beating the eggs with the sugar and the zest of the lemon.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nAdd the lemon juice and the butter and mix well.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nAdd the flour and mix only until you have a homogeneous batter. Let it rest for 30 minutes.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nPreheat the oven to 210ºC (410ºF). Sprinkle a baking tray with flour. Create small cookies with the help of a spoon and forming a ball with your hands.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nYou should have enough batter for 30 cookies.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nBake them in the preheated oven for 10 to 12 minutes. If they start to brown too quickly you should reduce the temperature.\r\r\n\r\r\nYour house will smell heavenly.\r\r\n\r\n\r\n",
        "tags": [
            "lemon",
            "portuguese",
            "pantagruel",
            "cookies"
        ]
    },
    {
        "uri": "/2012-02-09-chocolate-mousse",
        "title": "Chocolate Mousse",
        "content": "div class=\"description\" hidden\r\nWhile growing up Chocolate Mousse was a staple at my parents house in every special occasion. Christmas, Easter, birthdays, you name it and Chocolate Mousse was there. It's one of the three recipes that I know by heart: chocolate mousse, pancakes and sponge cake. It requires patience with the egg whites, but other than that there is really not much to it.\r\n/div\r\n\r\n\r\r\n\r\n\r\nh3Ingredients (span class=\"yield\"6-8 servings/span)/h3\r\n\r\n6 eggs\r\r\n6 tablespoons of granulated sugar\r\r\n200g of good dark chocolate (7oz)\r\r\n1 tablespoon of butter\r\r\n\r\nh3Instructions (Time: span class=\"duration\"4 hours/span)/h3\r\n\r\nStart by melting the chocolate with the butter in a double boiler. I used dark chocolate with 70% of cocoa because I think that it has a different texture when compared to regular cooking chocolate. When melted, it's shiny and silky. But you can use whatever chocolate you prefer. My mother uses 55% and it's just as good.  \r\r\n\r\n\r\r\n\r\nKeep an eye on you chocolate - don't let it cook. You can even take it off of the double boiler before it is completely melted and let it melt with the remaining heat from your pan. Let the chocolate rest for a couple of minutes.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nWhile the chocolate is melting separate the egg yolks from the whites.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n  \r\r\nNo matter what happens, the egg whites can't have any egg yolk, otherwise when you beat the egg whites they won't rise. Beat the egg whites until they're stiff.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAdd the sugar to the egg yolks and beat well until it turns into a pale mixture. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nSlowly add the melted chocolate to the egg yolks and sugar and never stop mixing the chocolate. If you add the chocolate while it's too hot or if you pour all the chocolate at once you might cook the egg yolks.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nOnce the chocolate is well mixed in the batter you can add the egg whites. You should be patient with the egg whites and fold them into the mixture as opposed to mixing them. Slowly fold the egg whites in the mixture by bringing the batter from the bottom to the top. If you mix the egg whites you will lose the air that the egg whites provide.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\n If your chocolate mousse is too liquid it's probably because you either didn't beat the egg whites until they were stiff or because you mixed them in the batter instead of folding them.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nPut it in the fridge for at least 3 hours.  \r\r\nI don't have a photo of the the chocolate mousse after being in the fridge because I didn't get to eat this one. :( I made it for my husband and his friends and they approved!\r\n",
        "tags": [
            "portuguese",
            "chocolate",
            "mousse"
        ]
    },
    {
        "uri": "/2012-02-12-pantagruels-chocolate-cake",
        "title": "Pantagruel's Chocolate Cake",
        "content": "\r\ndiv class=\"description\" hidden\r\nAnd here is another recipe from Pantagruel. This was the first time that I tried this recipe and it did not disappoint. I will definitely make this chocolate cake again, but I will change the baking time for the next time I use this one. The recipe asked for 45-50 minutes in the oven and after 30 minutes I checked it with a toothpick and it was done! \r\n/div\r\n\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"12 servings/span)/h3\r\n\r\n225g flour (1 cup) (+ a bit for the cake pan)\r\r\n150g granulated sugar (3/4 cup)\r\r\n130g butter at room temperature (4.5oz) (+a bit butter for the cake pan)\r\r\n60g unsweetened cocoa (2oz)\r\r\n1 teaspoon baking powder\r\r\n2 eggs\r\r\n1 egg yolk\r\r\n2 egg whites\r\r\n2 tablespoons milk\r\r\n1/4 tablespoon vanilla sugar\r\r\n\r\nh3Instructions (Time: span class=\"duration\"1 hour/span)/h3\r\n\r\nStart by preheating your oven to 180ºC (350F). Grease and flour a cake pan (I used a 22cm (8in) cake pan). Beat the sugar with the butter until you get a homogeneous batter.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nAdd the two eggs and the egg yolk and mix well.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAdd the flour, baking powder, cocoa, vanilla sugar and milk and mix until your batter starts to have bubbles.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nBeat the egg whites until they're stiff and fold the egg whites in the cocoa batter.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nIt's a rather dense batter even after adding the egg whites. But that it's fine you should be in the right track.\r\r\n\r\r\nTransfer the batter to the cake pan and bake for 30-35 minutes.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n  \r\r\n\r\r\nBefore taking the cake out of the oven check with a toothpick if the cake is baked in the middle (the toothpick should come out clean or with a few crumbs on it).\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nThe recipe suggested adding some chocolate and cream sauce but I skipped that part and it turned out to be a very tasty cake on its own!\r\r\n\r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "portuguese",
            "pantagruel",
            "cake",
            "chocolate"
        ]
    },
    {
        "uri": "/2012-02-14-eggplant-gratin",
        "title": "Eggplant Gratin",
        "content": "div class=\"description\" hidden\r\nThe first time I tried eggplant gratin was at my mother-in-law's house. And yesterday I decided to give it a try on my own. I'm not sure that the recipe that I came up with is an accurate replica but it tasted surprisingly good! The husband even said \"This actually tastes good, right?\" with a very confused look on his face. High praise. Every time I try to reproduce one of his mothers recipe I always get this gem \"It tastes good but my mother's is better\". But not yesterday.  \r\r\n/div\r\n\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"3 servings/span)/h3\r\n\r\n200g fresh mushrooms (7oz)\r\r\n1 medium onion\r\r\n2 garlic cloves\r\r\n3 eggplants\r\r\n250mL cooking cream (8%)\r\r\n2 tuna cans (300g/10oz)\r\r\nshredded mozzarella, parsley, soy sauce, olive oil, pepper, salt, nutmeg q.s.\r\r\n\r\nh3Instructions (Time: span class=\"duration\"1-1.5 hours/span)/h3\r\n\r\nStart by slicing your eggplants in half and remove the eggplant flesh with the help of a knife and a tablespoon.  You should try to make a shell out of the eggplant skin and keep the shells.  \r\r\n\r\n\r\r\n\r\nPut the eggplants' flesh in a colander and sprinkle with a good amount of salt. This way they won't absorb as much olive oil. If you're in a hurry you can skip this step. If not, wait 30 minutes before washing the eggplants' flesh with running water.  \r\r\n  \r\r\n\r\r\nPut a large frying pan on the stove top on medium heat and chop the onion and the garlic.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nAdd some olive oil to the pan and fry the onion and the garlic until the onion looks soft.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nAdd the mushrooms and stir occasionally.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nWhen most of the water from the mushrooms has evaporated season the mushrooms with a bit of salt, a bit of soy sauce and pepper to taste. While the mushrooms finish cooking chop the eggplants' flesh into small cubes. Add the eggplants' flesh to the pan when the mushrooms look soft and mix occasionally.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nThe eggplant will start to decrease in size significantly. Preheat your oven to 180ºC (350F).  \r\r\nTaste the eggplant and add the tuna and a handful chopped of parsley when the egg plant is cooked.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nSeason with a bit more salt, pepper and nutmeg. Let the tuna cook for 2 to 3 minutes and add the cream.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nMix well and let it cook for 2 to 3 minutes. Give it a taste and make the necessary corrections to your taste. At this stage I actually added more nutmeg.  \r\r\nLine your eggplants' shells in a baking dish and filled them with the mixture from your frying pan. Sprinkle with some shredded mozzarella to taste.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nYou should have one extra eggplant shell to which you don't have enough mixture. Bake in the oven for 8 minutes or until the cheese looks golden. And that's it!  \r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "portuguese",
            "eggplant",
            "tuna"
        ]
    },
    {
        "uri": "/2012-02-21-chocolate-bonbons-brigadeiros",
        "title": "Chocolate Bonbons (Brigadeiros)",
        "content": "div class=\"description\" hidden\r\nThese chocolate bonbons aren't really portuguese. More like brazilian. But they are quite common in Portugal and are amazing. They have a very intense flavor and gooey texture. This was the first time that I made this in Denmark because, until now, I wasn't able to find sweet condensed milk in the supermarket. But the other day there it was on the baking supplies' aisle. :)  \r\r\nIt's another recipe from Pantagruel!\r\r\n/div\r\n\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"20-24 bonbons/span)/h3\r\n\r\n1 can sweet condensed milk\r\r\n5 tablespoons of cocoa powder\r\r\n2 tablespoons of butter\r\r\nchocolate sprinkles, oil (for the traditional presentation)\r\r\n\r\nh3Instructions (Time: span class=\"duration\"30 minutes/span)/h3\r\n\r\r\nThis is what a can of sweet condensed milk looks like here in Denmark:\r\r\n\r\n\r\r\n\r\r\n  \r\r\nPut a pan on the stove top at medium-. Add the sweet condensed milk to the pan.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAdd the cocoa powder and the butter.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nMix well and keep mixing for about 8 minutes.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nYou'll know that it's ready when you can make a \"road\" on the bottom of the pan and the mixture is trying to separate itself from the pan.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nBefore you can make the bonbons, the mixture needs to cool down. Transfer it to a baking tray or whatever you have in hand. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nI didn't do the traditional brigadeiro presentation - perfect balls with chocolate sprinkles. Instead, I didn't let it cool down as much and used two teaspoons to form bonbons. If want to try the traditional presentation remember to oil your fingers before forming the bonbons.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nI think it looks cool this way. And eating them it a totally different experience! There will be chocolate all over your hands.\r\r\n\r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "pantagruel",
            "chocolate"
        ]
    },
    {
        "uri": "/2012-02-25-portuguese-punched-potatoes",
        "title": "Portuguese Punched Potatoes",
        "content": "\r\ndiv class=\"description\" hidden\r\nIt was time to share with you the recipe that gave name to this blog. We don't eat this as often as we should for something so tasty, because we don't have \"easy\" access to salted cod fish here in Denmark. It's sad but true. And this potatoes just ask for it. I actually get that feeling that there's something missing. \r\r\n\r\r\nBut it's better to eat them this way than to not eat them at all. In portuguese these are called \"Batatas à Murro\" and the \"punch\" part comes from the fact that you punch the potatoes after they're cooked. Punching them doesn't add anything to the flavor, on its own, BUT when you add olive oil that's when the party begins. I found portuguese olive oil on the market the other day and it just makes all the difference.\r\r\n/div\r\n\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"1-2 servings/span)/h3\r\n\r\n6 Small white potatoes \r\r\nSalt, portuguese olive oil q.s.\r\r\n\r\nh3Instructions (Time: span class=\"duration\"45 minutes/span)/h3\r\n\r\nPreheat your oven to 180ºC. Wash the potatoes and scrub them if necessary.  \r\r\n \r\n\r\r\n\r\r\n  \r\r\nPick an oven appropriate pan and generously sprinkle the potatoes with salt. Don't be shy.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nBake in the oven for 30-40 minutes. To check that they are cooked pierce the potatoes with a knife. They should be soft and the skin should be loose.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nRemove them from the oven and rub off the salt in the skin with your hands.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nOn a cutting board punch each potato once or twice. The potatoes should remain in one piece.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nDrizzle with olive oil to taste. The potatoes will absorb part of the olive oil and there should be olive oil in the plate. And if you feel like eating something even more decadent, heat the olive oil with some garlic and drizzle it over the potatoes. YUM!\r\r\n\r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "portuguese",
            "olive oil",
            "potatoes"
        ]
    },
    {
        "uri": "/2012-02-28-orange-sponge-cake",
        "title": "Orange Sponge Cake",
        "content": "div class=\"description\" hidden\r\nI mentioned on a post about the  a href=\"{{< relref \"/recipes/2012-02-09-chocolate-mousse.md\" }}\"chocolate mousse/a that I know three dessert recipes by heart. I've shared the a href=\"{{< relref \"/recipes/2012-01-28-saturdays-pancakes.md\" }}\"pancake recipe/a, the chocolate mousse and now it's time for the Sponge Cake. This time I decided to make an Orange Sponge Cake, but you can use the zest of a lemon instead of a zest of an orange. \r\r\n\r\nIn my family, we make this cake regularly for guests or to take with us to my grandparents. It comes out great every time!\r\n/div\r\n\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"12 servings/span)/h3\r\n\r\r\n6 eggs\r\r\nthe weight of the eggs in sugar \r\r\nhalf of the weight of the eggs in flour\r\r\n1 teaspoon of baking powder\r\r\nzest of an orange\r\r\nmilk (optional)\r\r\nbutter and flour for the baking pan\r\r\n\r\nh3Instructions (Time: span class=\"duration\"1 hour/span)/h3\r\n\r\r\nPreheat your oven to 180ºC (350ºF). Butter and flour the baking pan. Separate the egg whites and the egg yolks, and beat the egg yolks with the sugar until you get a creamy and pale mixture.\r\r\n\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAdd the zest of an orange to the batter and mix well.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nOn a separate bowl, beat the egg whites until they're stiff.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAdd the flour and the baking powder to the egg yolk and sugar mixture and mix well. If you feel that the batter it's too dry and you can't mix the flour in properly, add milk one tablespoon at a time. The moisture of the batter will depend on the size of your eggs. It should not be runny - the batter should stand on it's own.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nFold in the egg whites, bringing the mixture from the bottom of the bowl to the top.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nYou'll get a fluffy and bubbly batter.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nTransfer the batter to a baking pan.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAnd cover the baking pan with aluminum foil. Bake in the oven for a total of 30 minutes. After 15 minutes remove the aluminum foil so that the cake can get some color.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\nTo check if the cake is done pierce the cake with a toothpick. The toothpick should come out clean.\r\r\n\r\n\r\r\n\r\nRemove the cake from the baking pan and let it cool down.  \r\r\n\r\n\r\r\n\r\n\r\n",
        "tags": [
            "orange",
            "cake"
        ]
    },
    {
        "uri": "/2012-03-03-chicken-stew",
        "title": "Chicken Stew",
        "content": "div class=\"description\" hidden\r\nAnd now another recipe from Pantagruel. This was the first time that I tried this recipe, although I feel like I've eaten this dish numerous times before. It reminds me of the chicken stew that used to be served at my university's dining hall. A better version of it for sure. When defining \"comfort food\" this dish should definitely be included. However, it takes a long time to cook so you should try it during the weekend. (The recipe asked for a clay pan but I used a regular pan.)  \r\r\n/div\r\n\r\n\r\r\n\r\r\nh3Ingredients (span class=\"yield\"4 servings/span)/h3\r\n\r\n1 (2kg / 4pounds) free range chicken\r\r\n2 medium size onions\r\r\n2 medium size carrots\r\r\n2 garlic cloves\r\r\n60g (2oz) bacon\r\r\n1 bunch of parsley\r\r\n1 bay leaf\r\r\nolive oil, salt, pepper q.s.\r\r\n\r\nh3Instructions (Time: span class=\"duration\"2.5 hours/span)/h3\r\n\r\nStart by carving the chicken.  \r\r\n \r\n\r\n\r\n\r\nIf you've never carved a chicken before, you can either ask your butcher to do it for you, or you can watch a tutorial on youtube.\r\n  \r\nChop the onions, carrots and garlic.  \r\r\n\r\n\r\r\n\r\n\r\nIn a pan fry the bacon until you're left with the bacon rind and the fat from the bacon. Remove the bacon rind from the pan and save it in case you want to use it somewhere else.\r\n\r\n\r\n\r\n\r\nAdd some olive oil, the onions, the carrots, the garlic and the bay leaf to the pan.\r\r\n\r\n\r\r\n\r\nAnd on top of that add the chicken pieces. Let it cook in medium- heat.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nThis step will take the longest. Mix occasionally and add a bit of water if the pan starts to dry. After 45 minutes the chicken should have some color.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nCover the chicken with water and add the chopped parsley. Season with salt and pepper and put the lid on the pan. Let it cook for about 30 minutes in medium- heat.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nThe chicken should be tender and the sauce should be fairly thick. Taste the sauce and add more salt if necessary.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nAdd fresh parsley and serve!  \r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "portuguese",
            "pantagruel",
            "chicken",
            "stew"
        ]
    },
    {
        "uri": "/2012-03-06-camels-dribble-baba-de-camelo",
        "title": "Camel's Dribble (Baba de Camelo)",
        "content": "\r\ndiv class=\"description\" hidden\r\nToday I'll share my mum's recipe for Camel's Dribble. Don't let the title scare you. Camel's Dribble is basically caramel mousse. It's extremely sweet and has a very intense flavor. Sweeter than a href=\"{{< relref \"/recipes/2012-02-09-chocolate-mousse.md\" }}\"Chocolate Mousse/a for instance. Consider yourself warned - if you like sweets, there's something delicious on your way.\r\n/div\r\n\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"10 servings/span)/h3\r\n\r\r\n1 can of cooked or uncooked sweet condensed milk\r\r\n5 eggs\r\r\n\r\nh3Instructions (Time: span class=\"duration\"3-6 hours/span)/h3\r\n\r\nIf you can find cooked sweet condensed milk in your supermarket then you can skip this step, otherwise you'll need to boil your uncooked can. If you have a pressure cooker it will need only an hour to cook, but if you haven't got one then it should take 2h30. Remember to let the can cool down before opening it. \r\r\n\r\nSeparate the egg yolks form the egg whites. \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAdd the cooked sweet condensed milk to a pan.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nMix for a bit until you get a liquid mixture. Beat the egg yolks and add them to the pan. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nMix well for 4-5 minutes until you have thick mixture. Transfer the mixture to a bowl. If you find that your mixture has bits of condensed milk that aren't dissolved, strain the mixture into the bowl instead. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nBeat the egg whites until they're stiff and add it to the mixture. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nFold the egg whites carefully from the bottom of the bowl to the top. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nYou should have a fluffy and bubbly mixture. Transfer to a serving bowl and refrigerate for 2 hours. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nEnjoy.\r\r\n\r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "portuguese",
            "mousse"
        ]
    },
    {
        "uri": "/2012-03-10-pork-belly-roast",
        "title": "Pork Belly Roast",
        "content": "div class=\"description\" hidden\r\nIn kind of an homage to Denmark, I will share a recipe my favorite danish dish. You can find it in the prepared food section in the supermarkets all year long, but it's also a traditional Christmas dish. I used a a href=\"http://www.jamieoliver.com/recipes/pork-recipes/pork-belly-roast\"Jamie Oliver recipe/a) which I think is pretty similar to the ones you can find here in Denmark.\r\n/div\r\n  \r\r\n\r\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"6 servings/span)/h3\r\n\r\n1,5kg (3.5 pounds) pork belly \r\r\n2 onions\r\r\n2 carrots\r\r\n2 celery sticks\r\r\n1 bulb of garlic\r\r\nsalt, pepper, q.s.\r\r\n\r\nh3Instructions (Time: span class=\"duration\"2.5 hours/span)/h3\r\n\r\nPreheat your oven to 220ºC (425ºF). With a knife mark scores on the skin side of the pork belly, 1cm apart. Rub the pork belly with salt, including inside the scores you just made. Season the underside of the pork belly with a bit of pepper.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nRoast for half an hour and reduce the heat to 180ºC (350ºF). \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nRoast 1h more. Remove from the oven and transfer the pork belly to a chopping board. Add all the vegetables to the tray and place the pork belly on top of the vegetables.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nRoast for another hour. If you want to make a gravy with the roasted vegetables check the original recipe.\r\r\n\r\n\r\r\n\r\nSlice the pork belly and serve. I roasted some potatoes to go with it.  \r\r\n\r\n\r\n",
        "tags": [
            "roast",
            "danish",
            "pork"
        ]
    },
    {
        "uri": "/2012-03-13-milk-bread",
        "title": "Milk Bread",
        "content": "div class=\"description\" hidden\r\nToday I'll be sharing a recipe from Pantagruel of a common bread substitute for breakfast or a mid-afternoon snack. I don't have a mixer, so I just did everything by hand, but if you have a mixer it should be a lot easier. The recipe only asks for a small amount of sugar, but it makes all the difference. They should be soft and fluffy.\r\r\n/div\r\n\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"8-10 buns/span)/h3\r\n\r\n300g (2 1/2 cups) flour\r\r\n70g  (1/3 cup) sugar \r\r\n25g (0.9 oz) baker's yeast\r\r\n20g (0.7 oz) butter\r\r\n2dl (a little less than 1 cup) milk\r\r\n1/2dl (a little less than 1/4 cup) warm water\r\r\n2 eggs\r\r\n1/2 teaspoon salt\r\r\n\r\nh3Instructions (Time: span class=\"duration\"2-3 hours/span)/h3\r\n\r\r\nStart by dissolving the baker's yeast in the warm water.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAdd 30g (1/4 cup) of flour and make a small ball. Transfer to a small bowl and add more warm water (3 tablespoons). Let it double in size.\r\r\n\r\n\r\n\r\n\r\nOnce it has doubled in size, mix the flour, one egg, milk, butter, sugar and the baker's yeast. Knead the dough for 5 minutes or until you can feel that the dough has some elasticity. Cover the bowl with two kitchen towels and let it rise until it has doubled in size. This step might take some time, depending on the temperature in your kitchen. I waited an hour the next step.  \r\r\n\r\n\r\n\r\n\r\nSprinkle some flour on a baking tray and on a clean surface. In the floured surface, knead 12 balls of dough and place them on the baking tray. You should knead each dough ball 5-6 times with your hand to give them shape. Cover the baking tray with two kitchen towels and let it rise for 30 minutes.  \r\r\n\r\n\r\n\r\n\r\nPreheat your oven to 220ºC (430ºF). Beat one egg and lightly brush the balls of dough.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nBake for 10-15 minutes. Remember to check if they're done with a toothpick.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\nLet it cool down and serve! A traditional way of eating this would be with butter and ham. But it goes well with anything or even on it's own.\r\r\n\r\n\r\r\n\r\n",
        "tags": [
            "portuguese",
            "pantagruel",
            "bread"
        ]
    },
    {
        "uri": "/2012-03-17-beef-stew",
        "title": "Beef Stew",
        "content": "div class=\"description\" hidden\r\nToday's recipe is a Portuguese classic, just like the a href=\"{{< relref \"/recipes/2012-03-03-chicken-stew.md\" }}\"Chicken Stew/a I shared before. It's from Pantagruel, and it takes about three hours to cook so it's probably a good weekend recipe. When adding the carrots and shallots, you can also add potatoes, hence avoiding the need to cook a side dish. I didn't add the potatoes to the pot. Instead, I accompanied the beef stew with roasted potatoes (recipe to come).\r\n/div\r\n\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"3.5 hours/span)/h3\r\n\r\n1kg (2.2lb) stewing beef (I used a cut from the round)\r\r\n8 bacon slices\r\r\n10 shallots\r\r\n2 garlic cloves\r\r\n2 medium onions\r\r\n3 carrots\r\r\n1 bunch of parsley\r\r\n1 tablespoon vinegar \r\r\nolive oil, salt, pepper, water, q.s.\r\r\n\r\nh3Instructions (Time: span class=\"duration\"2 hours/span)/h3\r\n\r\r\nStart by chopping the onions and the parsley. Smash the garlic cloves.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nPlace the bacon on the bottom of a pot and add some olive oil.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAdd the chopped onions, the parsley, the garlic, the vinegar and season with pepper.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nRub the piece of meat with salt and add it to the pan. Add 3 tablespoons of water.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nCover your pot and let it cook for 1h30 on low heat.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAdd the shallots and the carrots, cover the pot and let cook for 1h30 more. Check from time to time and add water to the pot (1 or 2 tablespoons) if it starts to dry.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nSlice the meat and serve!  \r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "portuguese",
            "beef",
            "pantagruel",
            "stew"
        ]
    },
    {
        "uri": "/2012-03-20-white-bean-tarts",
        "title": "White Bean Tarts",
        "content": "div class=\"description\" hidden\r\nWhite Bean Tarts are a traditional pastry from central Portugal (where I happen to come from). But you can  find this tarts all over the country (Lisbon's airport included). They're extremely sweet and taste nothing like beans. They work great for a party or to accompany an espresso for your mid-afternoon snack. This was the first time I used this recipe and it worked out great.  \r\r\n/div\r\n\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"12 tarts/span)/h3\r\n\r\n500g (2 1/2 cups) caster sugar\r\r\n300g (10.5oz) dried white beans\r\r\n150g (5oz) pealed almonds\r\r\n10 egg yolks\r\r\n250mL (1 cup) water \r\r\n\r\nh3Instructions (Time: span class=\"duration\"12 hours/span)/h3\r\n\r\nThe night before, soak the white beans covering them with water.  \r\r\n\r\n\r\r\n\r\r\n  \r\r\nThe following day, cook your beans for 1h30 in a pot top on.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nWhile the beans are cooking, grind the almonds (if you can't find pealed almonds you can soak them in hot water for 3 minutes, rinse them and peal them by hand).  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nAfter the beans finish cooking drop them in a colander. You'll need a kitchen sieve where you'll mash the beans into a bowl, so that the peels from the beans stay on the sieve and the puree drops into the bowl.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nWeight the bean puree - you'll need 250g.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nBring the sugar and the water to a boil on a pot at medium temperature.  \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nYou want the sugar syrup at the thread stage.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nTo check if you're there, have a bowl with cold water (you might want to add some ice cubes), dip your fingers in the cold water, with a spoon take a bit of the syrup and touch the syrup with your middle finger. Press it against your thumb and if a thread is made between your fingers you have found the correct stage.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n(Note: image from a href=\"http://grosse.is-a-geek.com/\" style=\"text-align: justify;\"http://grosse.is-a-geek.com/a).\r\n\r\nOr if you have a candy thermometer you want the syrup to be at 110ºC (225ºF). To learn more about the stages of sugar syrup check what joyofbaking.com has to say.\r\n  \r\r\n\r\r\nWithout removing the pan from the stove top, add the almonds to the syrup and mix well, until the almonds are incorporated.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nAdd the beans puree. Continue to mix until you can find the bottom of your pan. Remove it from the heat and let cool down.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nPreheat your oven to 150ºC (300ºF). Grease a muffin pan with butter. Beat the egg yolks and add to the mixture.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nPut it on the stove top once again, just until it starts to boil. Transfer to the muffin pan and bake in the oven for 25 minutes or until the tarts turn golden.  \r\r\n\r\n\r\n\r\n\r\r\nTake them out of the pan once they have cooled down a bit and serve with some powdered sugar.  \r\r\n\r\n\r\n",
        "tags": [
            "portuguese",
            "pantagruel"
        ]
    },
    {
        "uri": "/2012-03-24-roasted-cheese-potatoes",
        "title": "Roasted Cheese Potatoes",
        "content": "div class=\"description\" hidden\r\nToday I'll share another recipe from Pantagruel. I'm not sure that it's a Portuguese recipe, but it sounded good and I decided to give it a try. It was very tasty! And it worked out great with the a href=\"{{< relref \"/recipes/2012-03-17-beef-stew.md\" }}\"Beef Stew/a that I shared last week.\r\n/div\r\n\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"4 servings/span)/h3\r\n\r\n750g (26oz) finely sliced potatoes\r\r\n150g (5oz) grated mozzarella\r\r\n40g (1.5oz) grated parmesan\r\r\n2 eggs\r\r\n2 1/2dl (1 cup) milk\r\r\nbutter, salt, pepper, nutmeg q.s.\r\r\n\r\nh3Instructions (Time: span class=\"duration\"1 hour/span)/h3\r\n\r\r\nPreheat your oven to 150ºC (300ºF). Grease an oven appropriate pan with some butter. Place a layer of potatoes on the pan and season with salt, ground pepper and ground nutmeg.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nSprinkle some mozzarella on top of the potatoes.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nRepeat for two more layers. In a bowl, beat the eggs and add the milk. Cover the potatoes with the mixture and sprinkle the parmesan. (I didn't use parmesan because the husband doesn't like it).\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\nBake in the oven for 40 minutes or until the potatoes are cooked.  \r\r\n\r\n\r\r\n\r\r\n  \r\r\nAnd serve!  \r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "pantagruel",
            "potatoes"
        ]
    },
    {
        "uri": "/2012-03-27-algarves-honey-cake",
        "title": "Algarve's Honey Cake",
        "content": "div class=\"description\" hidden\r\nI looked at this recipe several times before deciding that it might be a good one. The fact that it includes olive oil on the ingredients list threw me off at first, but my curiosity got the better of me and I am grateful for it. It was an exceptional good cake with a lot of flavor and a very soft texture. Yes, it asks for a lot of honey, but in the end it was just the right amount.  \r\r\nI can't seem to find a tube cake pan in Denmark, which I think would benefit this cake a lot. Something like this:\r\n\r\nimg src=\"/images/2012-03-27-algarves-honey-cake-forma_bolo.jpg\" alt=\"algarves-honey-cake0\"/\r\n\r\r\n(Note: image from: http://cozinheiraprimeiraviagem.blogspot.com.)\r\n\r\nI noticed that the sides of the cake baked a lot faster than the middle part, which could be solved with a pan like the one in the photo resulting in a moister cake.\r\r\n\r\nAnd on the subject of cakes, the following quote from 1945 can be found on this chapter's introduction:\r\r\n\r\r\nu\"A feitura dum bolo é a mais feminina de todas as actividades caseiras da mulher.\"/u\r\n\r\r\nWhich can be translated to:  \r\r\n\r\r\n\"The baking of a cake is the utmost feminine of all of women's home activities.\"\r\r\n\r\r\nThat is beautiful.  \r\r\n/div\r\n\r\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"12 servings/span)/h3\r\n\r\n5 eggs\r\r\n250g (2 cups) flour\r\r\n250g (1 1/4 cup) sugar\r\r\n300mL (1 1/2 cup) honey\r\r\n2 tablespoons of olive oil\r\r\n1 teaspoon of baking powder\r\r\nzest of half a lemon\r\r\npinch of ground cloves\r\r\n\r\nh3Instructions (Time: span class=\"duration\"50 minutes/span)/h3\r\n\r\nPreheat the oven to 180ºC (350ºF). Grease a baking pan with butter and sprinkle some flour on it. \r\r\n\r\n\r\r\n\r\r\n  \r\r\nBeat the eggs with the sugar until thick.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nAdd the olive oil and the honey and mix well until you have an uniform batter.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nAdd the zest of the lemon and the cloves.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nMix well. Add the flour and the baking powder and beat the batter until the bubbles start to rise.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nTransfer the batter to the baking pan (see description for pan's details) and bake for 40 minutes.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nFor the first 20 minutes you should place an aluminium foil sheet on top of the baking pan. Use a toothpick to check if the cake is baked in the middle. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nServe as it is or add some extra honey.  \r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "lemon",
            "portuguese",
            "pantagruel",
            "honey",
            "cake",
            "olive oil"
        ]
    },
    {
        "uri": "/2012-04-28-easter-leg-of-lamb",
        "title": "Easter Leg of Lamb",
        "content": "div class=\"description\" hidden\r\nThere is nothing Eastery about this recipe, except for the fact that in Portugal people tend to have lamb or baby goat for Easter lunch. I don't think that it is as traditional as it is to have dried codfish for Christmas, for instance. But if you ask someone what they usually eat on Easter Sunday they would probably answer lamb. It's a simple recipe with and abundance of flavors and, as the majority of roasts, ideal for the weekend.\r\r\n/div\r\n\r\n\r\r\n\r\n\r\nh3Ingredients (span class=\"yield\"4 servings/span)/h3\r\n\r\n1 leg of lamb (1,5kg/3.5lb)\r\r\n8 tablespoons butter\r\r\n4 garlic cloves\r\r\n6 thyme sprigs\r\r\n6 sage leaves\r\r\n2 lemons\r\r\n1dl oil (1/2cup)\r\r\n12 pepper seeds\r\r\nsalt, white wine q.s.\r\r\n\r\nh3Instructions (Time: span class=\"duration\"2.5 hours/span)/h3\r\n\r\nPreheat your oven to 180ºC (350ºF). Start by finely chopping the garlic cloves (you can also use a garlic press if you have one).\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nPick the thyme and the sage leaves.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAdd the oil to the bottom of an oven tray. Rub the leg of lamb with salt and with the garlic, and place it on the tray. Place the herbs on the lamb and squeeze the juice out of the lemons on top of the it. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nPlace the butter on the lamb and sprinkle the pepper seeds. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nRoast for 2 hours but remember to baste the lamb every 20/30 minutes with the juices on the tray. If it becomes too dry, add some white wine (I used quite a bit of wine). And if you want to serve the lamb with potatoes, add the potatoes to the tray after 1h30. Season the potatoes with salt before adding them to the tray. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nCarve the lamb and serve!  \r\r\n\r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "portuguese",
            "special occasion",
            "lamb",
            "pantagruel"
        ]
    },
    {
        "uri": "/2012-05-01-easter-bread",
        "title": "Easter Bread",
        "content": "div class=\"description\" hidden\r\nContinuing with the Easter topic, here is a recipe for a traditional Easter bread called \"Folar\", from Pantagruel. The presentation doesn't exactly match what you would find in Portugal, but the taste sure does. The a href=\"(http://www.tentacaodosabor.com/receita-de-folar-de-pascoa/\"traditional presentation/a includes a baked egg in the middle of the bread (that we actually don't like). And I happened to forgot to brush the bread with egg yolk. :)\r\n/div\r\n\r\n\r\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"2 loaves/span)/h3\r\n\r\r\n475g (4 cups) flour\r\r\n190g (6.7 oz) butter\r\r\n180g (2/3 cup + 1/4 cup)sugar\r\r\n30g (1oz) of baker's yeast\r\r\n15g (0.5oz) salt\r\r\n6 eggs\r\r\n1 egg yolk\r\r\n1dl (a little less than 1/2 cup) milk\r\r\n\r\r\n\r\nh3Instructions (Time: span class=\"duration\"12 hours/span)/h3\r\n\r\r\nThe night before, dissolve the baker's yeast in a little warm water.\r\r\n\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAdd 100g (less than 1 cup) of flour to the dissolved yeast, and add enough water to make a small ball. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nWarm the milk, transfer it to a bowl and place the ball inside the bowl.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nLet it rest until it doubles in size.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nMelt the butter in a double boiler. Beat the eggs and add the salt, the sugar, the melted butter and the mixture of yeast and flour.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nKnead the dough as if you're making bread.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nCover the bowl with two kitchen towels and let it rise until the next morning.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nThe next morning, grease a baking tray with butter, place a baking paper on top, butter the paper and sprinkle some flour on top of it. Sprinkle some flour on your counter top and shape two large balls with your dough. Place them on the baking tray and let it rise for 2 to 3 hours. Notice that I only used half of the  necessary quantity of the ingredients and as such I only baked one bread. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nPreheat your oven to 210ºC (410ºF). Brush the bread with a beaten egg yolk and bake for 15-20 minutes or until it turns golden. Use a toothpick to check if the bread is done.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nLet it cool down and enjoy it with some butter, jam, or on it's own.\r\r\n\r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "portuguese",
            "special occasion",
            "pantagruel",
            "bread"
        ]
    },
    {
        "uri": "/2012-05-06-orange-ginger-chicken-thighs",
        "title": "Orange & Ginger Chicken Thighs",
        "content": "div class=\"description\" hidden\r\nToday's recipe comes from Pantagruel and this was the first time that I gave it a try. The fresh ginger got my attention, but I have to say that it doesn't sound, or taste, very Portuguese. Nonetheless, it was very tasty and the mixture of orange and ginger resulted in a remarkably fresh aroma, making this recipe perfect for a summer day.\r\n/div\r\n\r\n\r\r\n\r\r\nh3Ingredients (span class=\"yield\"3 servings/span)/h3\r\n\r\n6 chicken thighs and/or whole legs\r\r\n1dl white wine\r\r\n1 tablespoon vegetable oil\r\r\n1/2 tablespoon fresh grated ginger\r\r\nzest 1 orange\r\r\nfresh mint leaves\r\r\nsalt q.s.\r\r\n\r\r\nh3Instructions (Time: span class=\"duration\"12 hours/span)/h3\r\n\r\r\nPrepare a marinade mixing the wine, the oil, the grated ginger, the zest of the orange and salt (note: although it doesn't say so in the recipe, I added very little salt to the marinade, and instead, seasoned the chicken right before roasting).\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\n In a bowl, soak the chicken thighs and/or legs in the marinade and let them rest overnight in the fridge.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nPreheat the oven to 200ºC and place the chicken thighs and/or legs in a tight-fitting oven pan. Cover with the marinade. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nRoast for 1h10.\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAnd serve with rice. Garnish with the fresh mint leaves.  \r\r\n  \r\r\n\r\r\n\r\r\n",
        "tags": [
            "ginger",
            "pantagruel",
            "orange",
            "chicken"
        ]
    },
    {
        "uri": "/2012-05-09-orange-roll",
        "title": "Orange Roll",
        "content": "div class=\"description\" hidden\r\nAn orange roll has very few ingredients and no flour at all. It might sound strange but this specific kind of roll doesn't need it. There are a lot of different kinds of rolls and it is a rather common dessert in Portugal. It is fresh and light. This is my mum's recipe which I think is better than the one from Pantagruel (the only difference is in the quantity used). And I have to say that picking a baking tray with the right measurements is key. The photos displayed in this post might or might not be from my second attempt at this recipe.\r\n/div\r\n\r\n\r\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"10 servings/span)/h3\r\n\r\n8 eggs\r\r\n300g (1 + 1/2 cups) granulated sugar\r\r\n1 orange\r\r\n1 tablespoon of butter\r\r\nbutter, sugar q.s.\r\r\n\r\nh3Instructions (Time: span class=\"duration\"3 hours/span)/h3\r\n\r\nPreheat the oven to 190ºC (375ºF). In a bowl, beat the eggs with the sugar until the mixture has thickened.\r\r\n\r\n\r\r\n\r\r\n  \r\r\nMelt the butter.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nAdd the zest and juice of the orange and the melted butter to the bowl.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nGrease a baking tray of 35x25 / 13.5''x9.5'' (if you have a smaller tray like I do, don't use all the mixture, otherwise later when folding the roll it might break - the roll should be 1cm / 0.5'' thick). Place baking paper on the tray and grease with butter as well.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nPlace the mixture in the tray and bake for 20 minutes.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nSprinkle some sugar on top of a clean kitchen towel, and once the roll is baked, turn it over to the kitchen towel (without letting it cool down).\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nI'm not going to lie - this is tricky. You can't just pick up the roll from the tray and place it on the kitchen towel. It will be too hot to handle with your bare hands, and with oven mitts you won't have enough dexterity. You will have to turn it over. Just try to be quick about it and you should be fine.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nNow the folding part is just as interesting. If the roll is too thick you won't be able to roll it without breaking it. Remove the baking paper. Start on the narrower side of the roll and roll it with the help of the kitchen towel. You won't need to touch the roll and the kitchen towel will work for you.\r\r\n\r\r\n  \r\r\n\r\r\nOnce it has cooled down, place it on the fridge for at least 2 hours.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nAnd serve.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "portuguese",
            "orange"
        ]
    },
    {
        "uri": "/2012-05-13-fried-steak-with-baked-mashed-potatoes",
        "title": "Fried Steak with Baked Mashed Potatoes",
        "content": "div class=\"description\" hidden\r\nPan Fried Steak is a Portuguese classic. I cook this at least once every other week and it never fails me. In Portugal, you can find this in almost every restaurant and it's usually accompanied by french fries, rice and a fried egg. This is my mum's recipe. As for the baked mashed potatoes, the recipe comes from Pantagruel and they were creamy with an added outside crunch.\r\r\n/div\r\n\r\n\r\n\r\nh3Ingredients (span class=\"yield\"8-10 tarts/span)/h3\r\n\r\nuFor the Steaks/u\r\n\r\n4 steaks (150g/5oz each)\r\r\n4 cloves of garlic\r\r\n1/4 Knorr beef Bouillon cube\r\r\nbutter, vegetable oil, salt, pepper, white wine q.s.\r\r\n\r\nuFor the Baked Mashed Potatoes/u\r\r\n\r\n0,5kg of potatoes (or 6 big potatoes)\r\r\n30g (1/4 stick) butter\r\r\n2 eggs\r\r\nnutmeg, salt, pepper, chives, q.s.\r\r\n\r\n\r\r\nh3Instructions (Time: span class=\"duration\"1 hour/span)/h3\r\n\r\nuPan Fried Steak/u\r\r\n\r\r\n  \r\r\n\r\r\nHeat a frying pan at medium heat and mince the garlic cloves. Add some butter, some vegetable oil and the garlic to the pan. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nLet the garlic fry for 2 minutes and add the steaks.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nSeason with salt and pepper and fry the steaks turning them from time to time. When the pan starts to dry out, your steaks should be cooked, and you can now start with the sauce. If you like your steaks rare you should remove them from the pan, otherwise it's o.k. to leave them in the pan. Add some wine, the Knorr cube and some more pepper to the sauce. Scrape the bits of fried garlic from the pan - this will give color and flavor to the sauce. After a few minutes taste the sauce and make the necessary adjustments. Let the sauce simmer for 5 minutes.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAnd serve. For this to be more Portuguese there are a few elements missing, which I hope I can show here, the next time I go to Portugal.\r\r\n\r\r\n  \r\r\n\r\r\n  \r\r\nuBaked Mashed Potatoes/u  \r\r\n  \r\r\nBoil the potatoes with the skin.  \r\r\n  \r\r\n\r\r\n\r\r\nPreheat your oven to 210ºC (410ºF). Peel the potatoes while they're still hot and mash them.\r\r\n\r\r\n\r\n\r\nSeason with salt, pepper and nutmeg. Add the eggs and the butter and mix well.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\nGrease an oven tray with butter and spoon the mixture forming little mountains of mashed potatoes. Bake until golden.\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nGarnish with chopped chives and serve!\r\r\n\r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "portuguese",
            "beef",
            "pantagruel",
            "potatoes"
        ]
    },
    {
        "uri": "/2012-05-17-chocolate-salami",
        "title": "Chocolate Salami",
        "content": "div class=\"description\" hidden\r\nChocolate Salami is another classic Portuguese recipe. I wouldn't say that it is historically old, but while growing up in Portugal you would find it most kids parties. You can also find it supermarkets and coffee shops, but nothing beats the homemade version. It requires no cooking and you can assemble everything in less than half an hour - or even faster if you have a food processor. This recipe is from Pantagruel. Make sure to use sweetened chocolate powder, because otherwise it will be too bitter.\r\r\n/div\r\n\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"12 servings/span)/h3\r\n\r\n200g (7oz) sweetened cocoa powder\r\r\n200g (a little less than 1 cup) granulated sugar\r\r\n200g (7oz) sweet butter biscuits (Marie biscuit or Petit Beurre)\r\r\n125g (1 stick) butter\r\r\n4 eggs yolks \r\r\nbutter q.s.\r\r\n\r\nh3Instructions (Time: span class=\"duration\"3 hours/span)/h3\r\n\r\r\nThe recipe asked for Petit Beurre by Leibniz-Keks, but I couldn't find it here in Denmark. I used Marie biscuits instead.\r\r\n\r\n\r\r\n \r\r\nStart by crushing the biscuits into small pieces with a food processor or just smash the biscuits inside a kitchen towel with the help of a rolling pin.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nMelt the butter.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nWhile the butter melts, mix the chocolate powder and the sugar in a bowl.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nAdd the melted butter, the biscuits and the egg yolks.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\nMix well.\r\r\n\r\n\r\r\n\r\r\n  \r\r\nLay out a piece of aluminum foil and place the mixture on top of it. Form a cylinder as best as you can.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nCover the chocolate salami with the aluminum foil and place it on the fridge for at least 2 hours.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAnd slice the salami in 2 cm (~1in) slices. \r\r\n\r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "portuguese",
            "pantagruel",
            "chocolate"
        ]
    },
    {
        "uri": "/2012-05-21-milk-pizza-dough",
        "title": "Milk Pizza Dough",
        "content": "div class=\"description\" hidden\r\nI really wanted pizza the other day and since Pantagruel had a recipe for a milk pizza dough, it was the perfect opportunity to give it a try. And it was awesome. The crust was crispy and we picked a good mixture of toppings: mozzarella, feta cheese, olives, sweet pepper and onions. As for the sauce, I tried one from Pantagruel as well, but it was too sweet. I ended up using one from a href=\"http://www.jamieoliver.com/recipes/pizza-recipes/basic-pizza\"Jamie at Home/a.\r\n/div\r\n  \r\r\n\r\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"4 medium size pizzas/span)/h3\r\n\r\nuFor the sauce/u\r\r\n\r\n2 garlic cloves\r\r\n1 can of tomatoes (400g or 14oz)\r\r\nolive oil, salt, pepper, basil q.s.\r\r\n\r\nuFor the pizza dough (4 medium size pizzas)/u\r\r\n\r\n320g (2 2/3 cup) flour\r\r\n20g (0.7oz) baker's yeast\r\r\n1 1/2 dl (a little less than 2/3 cup) milk\r\r\nwater, salt q.s.\r\r\n\r\nh3Instructions (Time: span class=\"duration\"3.5 hours/span)/h3\r\n\r\r\n  \r\r\nHeat a pan and chop the garlic. Add some olive oil and the garlic to the pan. \r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nAdd the basil leaves and fry for just a minute. Add the tomato.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nSeason with salt and pepper and cook for 2/3 minutes. Strain the sauce and add it back to the pan. Let simmer until it thickens.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\nuFor the Pizza Dough/u\r\n\r\r\nStart by making a well with the flour in a clean surface. Heat the milk until it is just lukewarm. Dissolve the yeast in a little bit of lukewarm water. Season the milk with salt and place both the milk and the dissolved yeast in the center of the well. And make sure to make a bigger well than the one on the photo bellow, otherwise things might get out of control with yeast and milk spreading all over your counter...\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nMix with the help of a fork until you can start kneading the dough with your hands. Knead until you have a fluffy and elastic dough. You may have to add more water if the dough is too stiff. Form a ball and place it on a bowl.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nLet it rise for 2-3 hours with a damp kitchen towel on top of the bowl. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nOnce it has risen, divide it in four equal parts. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nFor each part, stretch the dough out with your hands until the it is 1/2cm high.  \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nPreheat your oven to 220ºC (420F). Spread some tomato sauce on your pizza and add your preferred toppings. I started by sprinkling some mozzarella on top of the tomato sauce and then added some olives, sliced onions, sweet peppers and feta cheese. Bake for 8-10 minutes or until the pizza crust is golden.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nAnd serve.  \r\r\n\r\n\r\r\n\r\n\r\r\n",
        "tags": [
            "pantagruel",
            "pizza",
            "italian",
            "cheese"
        ]
    },
    {
        "uri": "/2012-05-24-cinnamon-rolls",
        "title": "Cinnamon Rolls",
        "content": "div class=\"description\" hidden\r\nThe first time I visited Denmark, I tried their Cinnamon Rolls from some bakery and I have to say that I wasn't impressed. I also tried the store bought ones and although I liked them better, I got the feeling that I hadn't tried the real deal yet. So, when I saw that a href=\"http://www.aarstiderne.com\"Aarstiderne/a had released their recipe on their Facebook page I couldn't resist giving it a try (Aarstiderne supplies organically produced fruit and vegetables door to door). And they turned out great! The dough was soft and the filling was delicious. I wouldn't change a thing in this recipe.\r\n/div\r\n\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"20-24 buns/span)/h3\r\n\r\nuFor the dough:/u  \r\r\n\r\n200ml (1/2 + 1/3 cup) milk\r\r\n25g (0.9oz) baker's yeast\r\r\n1 tablespoon sugar\r\r\n175g (1 1/2 sticks) butter\r\r\n1 egg\r\r\n500-600g (4-5 cups) flour\r\r\n\r\nuFor the filling:/u\r\r\n\r\n3 tablespoons cinnamon\r\r\n1 tablespoon cardamon\r\r\n250g (2 sticks) softened butter\r\r\n200g (1 cup) granulated sugar\r\r\n\r\nuFor the garnish:/u\r\r\n\r\n2 tablespoons of hot water\r\r\n100g (1 cup) of icing sugar\r\r\n\r\nh3Instructions (Time: span class=\"duration\"3 hours/span)/h3\r\n\r\r\nStart by melting the butter and let it cool down a bit. While the butter melts, heat the milk until it's just lukewarm. Dissolve the yeast in the warmed milk.\r\r\n\r\n\r\r\n\r\r\n  \r\r\n\r\r\nTransfer to a bowl and add the sugar, the egg and the melted butter (in that order). \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAdd the flour and knead until the dough is soft and doesn't stick to your hands. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nNote: I made half the recipe and used 275g (2 + 1/3 cups) of flour. Just start with 500g (4 cups) and adjust from there. \r\r\n\r\r\nCover the bowl with a kitchen towel and let the dough rise for about an hour. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nSprinkle some flour on a clean surface and roll out the dough in a rectangle (1 1/2 cm or 0.6 in thick) with the help of a rolling pin.\r\r\n\r\r\n  \r\r\n\r\r\nuFor the filling/u\r\r\n\r\r\nMix all the ingredients.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\nSpread the filling over the dough. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nMake a roll with the dough starting from the broader side. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nCut the rolls 2cm (0.8in) thick. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nGrease an oven dish and place the rolls in it leaving some space between them. Let the cinnamon rolls rise for 30 minutes. \r\r\n\r\r\n  \r\r\n\r\r\n\r\n\r\n\r\nPreheat the oven to 200ºC (390ºF) and bake for 12-15 minutes or until they turn golden.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nuFor the garnish/u\r\n\r\r\nRemove the rolls from the oven after they're baked and, while they cool down for a bit, mix the sugar with the water.\r\n\r\n\r\r\n\r\r\n  \r\r\nDrizzle the rolls with the dissolved sugar.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAt this point, the smell from the fresh baked pastries will be hard to resist. The cinnamon rolls can be consumed warm or at room temperature.\r\r\n\r\n\r\r\n\r\n",
        "tags": [
            "cinnamon",
            "denmark"
        ]
    },
    {
        "uri": "/2012-05-28-roast-chicken",
        "title": "Roast Chicken",
        "content": "div class=\"description\" hidden\r\nToday's recipe comes from Pantagruel and I've used it several times already. It turns out great every time and it's super simple to prepare. However, this was the first time that I used a free range chicken and the difference was astonishing - the meat was tastier and the sauce left in the pan was better as well. As a side note, although you start by covering the chicken with bacon, you remove it by the end of the roast. This will give you a crispier skin but the taste of the bacon will still be there. No regrets here.\r\n/div\r\n\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"4 servings/span)/h3\r\n\r\n1 free range chicken (1,5kg/3.3pounds)\r\r\n50g (1/2 stick) butter\r\r\n8 strips of bacon\r\r\n1 big lemon\r\r\nsalt q.s.\r\r\n\r\nh3Instructions (Time: span class=\"duration\"1.5 hours/span)/h3\r\n\r\nPreheat your oven to 180ºC (360ºF). Rub the inside of the chicken with some salt and the juice of half the lemon (if you don't like to touch the chicken like me just throw it in there with the help of a tablespoon). Place the butter inside the chicken.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nRub the outside of the chicken with the juice from the other half of the lemon. If you care about how your chicken will look in the end, rub the chicken with a little bit of butter before covering it with the bacon stripes. Otherwise, later when removing the bacon, the skin of the chicken might come off as well. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nRoast for about an hour and remember to baste the chicken with the fat that is released in the roasting process. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nRemove the bacon and roast for another 30/40 minutes, or until it's cooked.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAnd carve the chicken. If you've never done this before you can check this video (that's how I learned).\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAnd serve!\r\r\n\r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "roast",
            "portuguese",
            "pantagruel",
            "butter",
            "chicken"
        ]
    },
    {
        "uri": "/2012-05-31-strawberry-cheesecake",
        "title": "Strawberry Cheesecake",
        "content": "div class=\"description\" hidden\r\nI started using this recipe while I was still in college because it was so simple and also because it was a big crowd pleaser. The original recipe included fresh cheese but I have never tried it that way. I've made so many changes to the recipe that I consider this my recipe for a no-bake cheesecake. You can use other kinds of jam. I know from experience that with mixed berry jam is just as good.\r\n/div\r\n\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"12 servings/span)/h3\r\n\r\n400mL (1 2/3 cups) cream (35-38% fat)\r\r\n200g (7oz) Philadelphia cream cheese \r\r\n2 tablespoons granulated sugar\r\r\n6 gelatin sheets\r\r\n200g (7oz) sweet butter biscuits (e.g. Marie biscuit)\r\r\n125g (1 stick) butter\r\r\n150g (5oz) strawberry jam\r\r\nsmall strawberries for garnish\r\r\n\r\nh3Instructions (Time: span class=\"duration\"4 hours/span)/h3\r\n\r\r\nStart by melting the butter. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nWhile the butter melts, grind the biscuits into a fine powder.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAdd the melted butter to the biscuits and mix.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nGrease a cake pan with a removable bottom.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nUse a spoon or your hands to form the base for the cheesecake with the biscuits.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nPlace the cake pan in the fridge for 15 minutes. Submerge the gelatin sheets in a bowl with cold water. They will turn soft after a few minutes. Remove the gelatin from the bowl and strain off the water as much as possible. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nDissolve the gelatin with 2 tablespoons of hot water.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nBeat the cream and half way through it add the sugar and the cheese.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAdd the dissolved gelatin and mix.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nTransfer the mixture to cake pan and place in the fridge for 2-3hours.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nThe jam that I used was too heavy, so I added about 3 tablespoons of water before spreading it over the cheesecake.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nWith a knife, carefully separate the cheesecake from the pan before unmolding it. Garnish with small strawberries and serve.\r\r\n\r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "strawberry",
            "butter",
            "cheese"
        ]
    },
    {
        "uri": "/2012-06-05-honey-cinnamon-cookies",
        "title": "Honey & Cinnamon Cookies",
        "content": "div class=\"description\" hidden\r\nAnd now for another surprisingly good cookies that include olive oil in the recipe (like the a href=\"{{< relref \"/recipes/2012-03-27-algarves-honey-cake.md\" }}\"Algarve's Honey Cake/a). The husband wanted to take some cookies with him to a competition and I usually bake a href=\"{{< relref \"/recipes/2012-02-04-lemon-cookies.md\" }}\"lemon cookies/a and something else. These were a perfect addition. The recipe is from Pantagruel and it included an alcoholic Portuguese beverage called a href=\"http://en.wikipedia.org/wiki/Aguardiente\"Aguardente/awhich I didn't include because I don't like desserts with alcohol. But if you do, just add 9 tablespoons (or 1 icálice/i if you have any idea what I'm talking about).\r\n/div\r\n  \r\r\n\r\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"20 cookies/span)/h3\r\n\r\n250g (1 1/4 cups) granulated sugar\r\r\n500-600g (4 to 5 cups) flour\r\r\n10g (2 teaspoons) cinnamon\r\r\n2dl (a little more than 3/4 cup) honey\r\r\n2.5dl (1 cup) olive oil\r\r\n2 eggs\r\r\n2 teaspoons baking powder\r\r\n1 lemon\r\r\n\r\nh3Instructions (Time: span class=\"duration\"30 minutes/span)/h3\r\n\r\nIn a bowl, add the sugar, the eggs, the cinnamon, the baking powder and the zest of the lemon.\r\r\n\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAnd finally, add the honey and the olive oil.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nMix well until it thickens.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAdd the flour until you can form small balls with the dough. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nPlace the cookies on a baking tray sprinkled with some flour.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nBake in a preheated oven to 220ºC (430ºF) for 8-10 minutes or until it turns golden.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\n.\r\n",
        "tags": [
            "portuguese",
            "pantagruel",
            "honey",
            "olive oil",
            "cinnamon",
            "cookies"
        ]
    },
    {
        "uri": "/2012-06-29-coriander-and-cumin-fried-pork",
        "title": "Coriander and Cumin Fried Pork",
        "content": "div class=\"description\" hidden\r\nI cook this all the time. It's quick and easy. There are several variations of this recipe in Portugal depending on the region you come from. Where I'm from we call it Fritadabut, for instance, in the North of Portugal they call it Rojões. I served it with rice but a more traditional way would be to top it with chopped pickles and serve it with fries. Unfortunately, I can't seem to find the right kind of pickles here in Denmark (an assortment of cauliflower, carrots and cucumber).\r\n/div\r\n\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"3 servings/span)/h3\r\n\r\n500g (1 pound) of diced pork\r\r\n4 garlic cloves\r\r\n1/4 cube of beef bouillon \r\r\nolive oil, butter, ground cumin, coriander, salt, paprika, white wine q.s.\r\r\n\r\nh3Instructions (Time: span class=\"duration\"45 minutes/span)/h3\r\n\r\nStart by mincing the garlic. Fry the garlic in a bit of olive oil and butter.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAdd the meat and season with salt and pepper.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nLet the pan dry and fry the meat just until it gets some color. Add white wine afterwards, and scrape the bits of meat from the pan - this will give color to the sauce.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nSeason with cumin and paprika (to give it color) and add the bouillon. After it is dissolved, taste the sauce and make the necessary adjustments. When the sauce is nearly done, add chopped coriander.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nSprinkle some fresh coriander on top and serve.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n",
        "tags": [
            "portuguese",
            "coriander",
            "pork"
        ]
    },
    {
        "uri": "/2012-07-03-portuguese-egg-tarts-pastel-de-nata-part-i",
        "title": "Portuguese Egg Tarts - Pastel de Nata (Part I)",
        "content": "\r\ndiv class=\"description\" hidden\r\nI've been wanting to try a iPastel de Nata/i recipe for years now. Pantagruel has two recipes, I tried them both and they were kind of bad... The taste was o.k. but the texture was nothing like the real deal. Who knows, maybe in the old days that's how they did it. Then I remembered that a aunt of mine used to bring a Portuguese egg tart (a whole tart) to my grandparents and thought that it might be worth a try. And it worked! The tarts were delicious. I wouldn't change a thing! Since I wasn't sure that this would work I didn't make puff pastry from scratch, but bought it at the store. So consider this the first part of my quest to find a good Pastel de Nata recipe. Needless to say that the pastry that I used wasn't the best. I do however have a recipe for puff pastry that I will try and share later.  \r\r\n/div\r\n  \r\r\n\r\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"16 tarts/span)/h3\r\n\r\r\n7dl (a little less than 3 cups) milk\r\r\n5 egg yolks\r\r\n3 lemon peels \r\r\n3 tbsp cornflour (Maizena) \r\r\n250g (1+1/4 cups)  sugar\r\r\nPuff Pastry (270g or 9.5oz)\r\r\n\r\nh3Instructions (Time: span class=\"duration\"1 hour/span)/h3\r\n\r\r\nStart by making a roll with the puff pastry beginning on narrowest side.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nSlice the roll in 16 equal parts (~2 cm or 0.8in each).\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nPlace a piece of pastry in each cup. Wet your fingers and push the pastry with your thumbs so that it forms a cup. Make sure to leave the bottom a lot thinner than the sides.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nNow for the filling: mix all the ingredients.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAnd cook the mixture on the stove top at medium heat while mixing constantly.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nAfter 15 minutes it will transform itself from a liquid mixture to a much thicker mixture.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nPreheat your oven to 200ºC (390ºF). Remove the lemon peels and place the mixture in each muffin cup, leaving a little space between the top of the pastry and the filling. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nBake in the oven for 30 minutes. And that's it!  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nServe as it is or add a little cinnamon and powdered sugar, accompanied by an espresso if you can. :)\r\r\n\r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "portuguese",
            "pastry",
            "pastel de nata"
        ]
    },
    {
        "uri": "/2012-07-06-johns-tuna-pasta",
        "title": "John's Tuna Pasta",
        "content": "div class=\"description\" hidden\r\nToday I'm sharing a very easy recipe for pasta. A friend from college came up with it. We used to cook this all the time because it's cheap and very tasty. And you can also add sweet corn if you like it.\r\r\n/div\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\n\r\nh3Ingredients (span class=\"yield\"2 servings/span)/h3\r\n\r\r\n1 medium onion\r\r\n2 garlic cloves\r\r\n200g (7oz) sliced fresh mushrooms\r\r\n2 cans of tuna (300g/10oz)\r\r\n125mL (1/2 cup) of cream\r\r\nparsley for garnish, spaghetti, nutmeg, salt, olive oil, pepper, q.s.\r\r\n\r\nh3Instructions (Time: span class=\"duration\"1 hour/span)/h3\r\n\r\nChop the onion and the garlic and fry it in some olive oil.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nOnce the onion is soft, add the mushrooms and season with salt and pepper.  \r\r\n\r\n\r\r\n\r\nAdd the tuna when the mushrooms are nearly done.\r\r\n\r\n\r\r\n\r\nMix well and season with nutmeg. Add the cream when the tuna is cooked (if you're adding sweet corn now is a good time to do it).\r\r\n\r\n\r\r\n\r\nSeason with more nutmeg, salt and pepper. Taste the sauce and make the necessary adjustments. And cook the spaghetti in salted boiling water.\r\n\r\n\r\r\n\r\nOnce the pasta is done add it to the pan and add a little of the spaghetti water (3 tablespoons).  \r\r\n\r\n\r\r\n\r\nMix well (it will be messy).\r\r\n\r\n\r\r\n\r\nAnd serve!\r\n\r\n\r\n",
        "tags": [
            "italian",
            "tuna"
        ]
    },
    {
        "uri": "/2012-07-10-portuguese-egg-tarts-pastel-de-nata-part-ii",
        "title": "Portuguese Egg Tarts - Pastel de Nata (Part II)",
        "content": "\r\ndiv class=\"description\" hidden\r\nNow for part II of the a href=\"{{< relref \"/2012-07-03-portuguese-egg-tarts-pastel-de-nata-part-i.md\" }}\"Portuguese Egg Tarts/a. As I mentioned before, I used store-bought puff pastry when I tried the egg tarts recipe for the first time. I promised a recipe for puff pastry and here it is. But I have to say that I was a little disappointed with the result. I was excepting it to be great but the texture wasn't 100% right. The flavor however surpassed the store-bought puff pastry without a doubt. The recipe didn't explain the process on it's entirety and, as such, I had to go with my gut. I used a recipe from a very famous Portuguese cooking book called \"Culinária Portuguesa\" (Portuguese culinary). It was recently reedited and I didn't think twice about buying it the last time that I was in Portugal. I hope to share great recipes from it. As for this recipe, be prepared if you do decide to try it because it's a lot of work!\r\r\n/div\r\n\r\n\r\n\r\nh3Ingredients (span class=\"yield\"12 tarts/span)/h3\r\n\r\nuFor the puff pastry/u:\r\n\r\n250g (2 cups) flour\r\n185g (1 +1/2 sticks) cold butter\r\r\n5g (0.2oz) salt\r\r\n1.5dl (2/3 cup) cold water \r\r\n\r\nuFor the filling/u:\r\n\r\n7dl (a little less than 3 cups) milk\r\n5 egg yolks\r\n3 lemon peels \r\n3 tbsp cornflour (Maizena) \r\n250g (1+1/4 cups)  sugar\r\n\r\nh3Instructions (Time: span class=\"duration\"2 hours/span)/h3\r\n\r\nMix all the ingredients except the butter. The quantity of water needed might change depending on how your's absorbs it. Add water if the dough is too dry. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nWork the dough for a bit.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nDivide the butter in 6 parts. You'll use 1/6 of the butter for each layer. Roll out the dough and spread bits of cold butter on top.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nFold the dough and roll it out again.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nRepeat the process 5 more times. I kept the butter on the fridge the whole time and because I felt the dough was getting warm, I placed it on the fridge for 10 minutes after the third part of butter. Once you're done with all the butter, divide the dough in two parts. Roll out each part so that the dough is 2mm (0.1in) high (I didn't have enough space to roll out the dough and that's why I divided the dough in two).\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nFrom here onward the process is the same as in Part I. Make a roll with the dough. \r\r\n\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nPrepare the muffin tins (this time I used special tins that are used in Portugal to bake the egg tarts).\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nPlace the dough in each tin.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAnd fill the dough with the egg tart mixture.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nBake in the oven for 30 minutes at a preheated oven to 200ºC (390ºF).\r\n\r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "pastry",
            "pastel de nata",
            "portugueseculinary"
        ]
    },
    {
        "uri": "/2012-07-13-chocolaty-chocolate-cake",
        "title": "Chocolaty Chocolate Cake",
        "content": "div class=\"description\" hidden\r\nThis was a first and it was mouthwatering. The cake recipe is from \"Culinária Portuguesa\" and the frosting is from Pantagruel. I added the almonds because I simply love the combo chocolate + roasted almonds. The cake was fluffy and the frosting remained shinny until the end. As for the taste, it had just the right amount of chocolate. Not too sweet.\r\r\n/div\r\n\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"12 servings/span)/h3\r\n\r\nuFor the cake/u  \r\r\n\r\r\n125g (1 stick) cold butter\r\r\n125g (1 cup) powdered sugar\r\r\n125g  (4.4oz) baking chocolate \r\r\n125g (1 cup) white flour\r\r\n1/2 teaspoon baking powder\r\r\n2 egg yolks\r\r\n3 egg whites\r\r\n\r\r\nuFor the frosting/u\r\r\n\r\r\n75g (2.6oz) chocolate with 70% cocoa \r\r\n75ml (1/3 cup) cream\r\r\nicing sugar q.s.\r\r\noptional: roasted almonds\r\r\n\r\nh3Instructions (Time: span class=\"duration\"1 hour/span)/h3\r\n\r\nuFor the cake/u\r\r\n\r\r\nStart by beating the butter until it softens.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nMelt the chocolate with 3 tablespoons of water.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nWhile the chocolate melts, mix the sugar with the butter.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAdd the melted chocolate and mix.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAnd add the egg yolks.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nFinally, add the flour and the baking powder.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nBeat the egg whites until stiff, and fold them in the cake batter.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nGrease a cake pan with butter and flour it. Transfer the batter to the cake pan.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAnd bake in a preheated oven to 180ºC (350ºF) for 25-30 minutes. Make sure to check if it is done with a toothpick.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nuFor the frosting/u\r\r\n\r\nMelt the chocolate. While the chocolate is melting, beat the cream for a bit (before it turns into whipped cream) and add icing sugar until you get the right consistency.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAnd add the chocolate. Unmold the cake and frost it with the chocolate mixture.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nOptional: roasted almonds.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nSprinkle the roasted almonds on top of the cake and serve!\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "cake",
            "chocolate",
            "portugueseculinary"
        ]
    },
    {
        "uri": "/2012-07-20-onion-sauce-steaks",
        "title": "Onion Sauce Steaks",
        "content": "div class=\"description\" hidden\r\nToday's recipe is another Portuguese classic. We call it iBifes de Cebolada/i and you can probably find it in any traditional Portuguese restaurant. I used a recipe from iCulinária Portuguesa/i. This was the first time that I made it in Denmark because until now, I couldn't seem to find steaks with the right thickness. I didn't think twice when I actually found them. The sweetness of the onions brings out your gluttonous self and you just can't stop eating.\r\n/div\r\n\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"3 servings/span)/h3\r\n\r\n4 steaks (1-2cm/0.5-1in thick)\r\r\n2 big onions\r\r\n2 garlic cloves\r\r\n1dl (1/2 cup) white wine\r\r\n50g (1/2 stick) butter \r\r\n1 tablespoon olive oil\r\r\nsalt, pepper, white wine (for the sauce) q.s.\r\r\n\r\nh3Instructions (Time: span class=\"duration\"4 hours/span)/h3\r\n\r\nStart by punching your steaks with a closed fist.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nSeason with salt and pepper.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nPlace the steaks in a bowl and add 1dl (1/2 cup) of wine.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nLet the steaks rest for 2 to 3 hours. \r\r\n\r\r\nSlice the onions finely, making half rings (I used a food processor but you can do it by hand).\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nChop the garlic and saute the onions and the garlic in the butter with the olive oil (so that the butter doesn't burn).\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAfter 15-20 minutes, the onions will turn golden. Remove the onions from the pan and keep them.\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nFry the steaks in the remaining fat.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nSince the steaks are really thin it only takes 3-4 minutes to cook. When the steaks are done, add the onions and some wine (enough to make the sauce).\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nSeason with a bit of salt and pepper. Scrape the bits off the pan and the sauce will turn brown. Cook the sauce until the taste of wine disappears.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAnd it's done! I served the steaks with peas, but a more classic way would be to serve it with mashed potatoes or french fries.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "portuguese",
            "beef",
            "portugueseculinary"
        ]
    },
    {
        "uri": "/2012-07-24-egg-flan",
        "title": "Egg Flan",
        "content": "div class=\"description\" hidden\r\nLast week I shared a traditional Portuguese main course a href=\"{{< relref \"/2012-07-20-onion-sauce-steaks.md\" }}\"Onion sauce steaks/a, but today I will share a classic dessert. You can literally find this in every Portuguese restaurant in Leiria (small town in central Portugal), and one can probably say the same for the remainder of Portugal. It's simple to make, refreshing and it has incredible flavor. For me the most difficult part is making the caramel due to my irrational fear of getting burned. But as always, nothing actually happened and the \"Pudim de Ovos\", as we call it, turned out great. I used my mum's recipe.\r\n/div\r\n\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"12 servings/span)/h3\r\n\r\n500ml (2 + 1/8 cups) milk\r\r\n200g (1 cup) granulated sugar\r\r\n150g (3/4 cup) granulated sugar (for the caramel)\r\r\n1 or 2 lemon peels (I used one big and one small)\r\r\n7 eggs\r\r\n\r\r\n\r\nh3Instructions (Time: span class=\"duration\"1 hour/span)/h3\r\n\r\nStart by melting the sugar in medium heat with 3 tablespoons of water.\r\r\n\r\n\r\r\n\r\r\n  \r\r\n\r\r\nKeep an eye on your caramel, mix occasionally and after a while it will turn golden.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nWhen the caramel is done, spread it on the flan tin (I used a special flan tin but you can use any other tube tin, like the one I used in the chocolate cake recipe).\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nMix the sugar, the milk and the lemon peels in a pan and bring to a simmer.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nBeat the eggs in a separate bowl.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nRemove the milk from the heat and remove the lemon peels from the milk, and slowly, while mixing constantly, add the milk mixture to the eggs.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nTransfer the mixture to the tin.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nPut the lid on the tin (if your tin doesn't have a lid, you can use aluminum foil), place the tin in an oven appropriate recipient, halfway filled with water, and bake in a preheated oven to 180ºC (350ºF).\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nRemove from the oven after 30-35 minutes (use a toothpick to check if it is done).\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nWait for it to cool down. \r\r\n\r\r\nWith your fingers push the flan down lightly, to loosen it up from the tin and unmold it. Place on the fridge for 1 hour and serve.\r\r\n\r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "portuguese",
            "flan",
            "caramel"
        ]
    },
    {
        "uri": "/2012-07-27-bruschetta",
        "title": "Bruschetta",
        "content": "div class=\"description\" hidden\r\nA simple and flavorful appetizer. It takes 20 minutes total and it's the perfect starter for a special occasion. And now would be a good time to use good quality extra virgin olive oil, because it will make all the difference. I have been using this recipe for a while, that is the result of several recipes put together.\r\n/div\r\n\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"4 servings/span)/h3\r\n\r\r\n1 loaf of day-old bread\r\r\n1 medium size tomato\r\r\n75g fresh mozzarella\r\r\n1 garlic clove\r\r\nolive oil, vinegar, salt, basil, q.s.\r\r\n\r\nh3Instructions (Time: span class=\"duration\"30 minutes/span)/h3\r\n\r\r\nStart by slicing the bread 2-3cm (1in) thick.\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nPour some olive oil in a bowl a season with salt.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nDip the bread slices on each side and place them in an oven rack. To avoid a messy oven, place an oven tray covered with parchment paper underneath the bread slices. Toast in a preheated oven to 180ºC (350ºF), until the bread turns golden.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nWhile the bread is in the oven, slice the tomato in small cubes, pull the mozzarella apart in small pieces and mix with the tomato. Season with salt, olive oil, a little vinegar and chopped basil leaves.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nOnce the bread is toasted, remove it from the oven and rub it with the garlic on both sides (peel the garlic clove and slice it in half).\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nPlace the tomato mixture on top of the bread.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAnd place the bread in the oven until the mozzarella melts. Drizzle some olive oil before serving.\r\r\n\r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "basil",
            "olive oil",
            "italian"
        ]
    },
    {
        "uri": "/2012-07-31-strawberry-birthday-cake",
        "title": "Strawberry Birthday Cake",
        "content": "\r\ndiv class=\"description\" hidden\r\nEvery since I can remember, all birthdays in my family are celebrated with this cake. There is no real reason not to make it for other occasions, but I can't help but feel that it is a birthday type of cake. It also helps that my birthday is in July and that I get to use really good strawberries. It's my favorite cake without a doubt. If you don't like wet cakes, skip the part where I use the juice of one orange. The recipe for the sponge cake is the same as the one I used in the a href=\"{{< relref \"/recipes/2012-02-28-orange-sponge-cake.md\" }}\"Orange Sponge Cake/a.\r\n/div\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"12 servings/span)/h3\r\n\r\r\n6 eggs\r\r\nthe weight of the eggs of sugar + 1 tablespoon\r\r\nhalf the weight of the eggs of flour\r\r\n1 teaspoon baking powder\r\r\n1 orange\r\r\n250ml of cream\r\r\n250g strawberries (for the filling)\r\r\n200g strawberries (for decorating)\r\r\nmilk, roasted chopped almonds, q.s.\r\r\n\r\nh3Instructions (Time: span class=\"duration\"4 hours/span)/h3\r\n\r\r\nStart by beating the eggs yolks with the sugar until they turn into a pale mixture. Add the zest of the orange, the flour and the baking powder and mix well. If the batter is too thick add milk.\r\r\n\r\n\r\n\r\n\r\n\r\nBeat the egg whites until they're stiff and fold them in the batter. Transfer the batter to a greased and floured cake tin. Bake in a preheated oven to 160ºC (320ºF) for 35-40 minutes (I reduced the temperature from the original recipe to reduce the chance of getting a dome looking cake).\r\r\n\r\n\r\n\r\n\r\n\r\nLet the cake cool down. Once it's room temperature, slice it in half forming two layers. Squeeze the orange onto each layer (the juice of half an orange should be enough for both layers).\r\r\n\r\n\r\n\r\n\r\r\nDice the strawberries in small cubes. Whip the cream and halfway through, add one tablespoon of sugar. Spread some whipped cream on the bottom layer (the base of the cake), place the strawberries on top and spread some more whipped cream on the other layer. Place the other layer on top of the strawberries and spread the remaining cream on the outside of the cake.\r\r\n\r\n\r\n\r\n\r\r\nPlace in the fridge for 2-3 hours. Sprinkle some roasted almonds on top and any other decorations and you're ready to blow out the candles.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "strawberry",
            "special occasion",
            "cake"
        ]
    },
    {
        "uri": "/2012-08-03-chourico-bread",
        "title": "Chouriço Bread",
        "content": "\r\ndiv class=\"description\" hidden\r\niChouriço/i Bread, or iPão com Chouriço/i as we call it, is a treat you can find in Portuguese markets and fairs. It's usually baked in a trailer with wood fired ovens. You can also find it year-round in supermarkets, cafes or, more specifically, in Lisbon at a href=\"https://foursquare.com/v/a-merendeira/4b0588a0f964a52093d022e3\"Merendeira/a. There are even places that serve not only ichouriço/i bread, but dried codfish bread, black pudding bread and pork rind bread. Good stuff. The recipe for the bread dough can also be used for baking regular bread. \r\r\n/div\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"2.5 hours/span)/h3\r\n\r\r\n500g (4 1/4 cups) strong white flour\r\r\n340g (12oz) lukewarm water\r\r\n1/2 tablespoon salt\r\r\n20g (0.7oz) fresh yeast\r\r\nichouriço/i q.s.\r\r\n\r\r\n\r\nh3Instructions (Time: span class=\"duration\"2 hours/span)/h3\r\n\r\r\nStart by dissolving the yeast and the salt in some of the water. Add some flour, so that the water and the yeast are absorbed. Continue adding flour and water until everything is mixed. Flour a clean surface and knead the dough until you have a silky and elastic dough (~5 minutes of kneading). (Note: I used a mixture of spelt and white flour and that is why my bread doesn't look completely \"white\". I just wanted to try it for no good reason. The real deal is with white flour only.)\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n  \r\r\n\r\r\nPlace the dough in a bowl, cover the bowl with a kitchen towel and let rise for 30 minutes or until it has doubled in size. Once is has risen, it's time to shape the bread. I divided the bread in 5 parts, but you can make the breads smaller if you wish. Flatten the bread with your hands or with a rolling a pin, until it is 1cm (0.5in) thick. Place two slices of chouriço on top of the dough and roll it. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n  \r\r\n\r\r\nPlace the breads on a floured baking tray, cover the tray and let it rise once again for 30-60 minutes (until it has doubled in size).\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nBake in a preheated oven to 200ºC (390ºF) for 20-25 minutes or until it turns golden. Let it cool down and dig in.\r\r\n\r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "portuguese",
            "chouriço",
            "bread"
        ]
    },
    {
        "uri": "/2012-08-07-wine-braised-beef-with-garlic-butter-potatoes",
        "title": "Wine-Braised Beef with Garlic Butter Potatoes",
        "content": "\r\ndiv class=\"description\" hidden\r\nThis recipe resulted in a flavorful braised beef. It's quite simple to make although it takes nearly 2 hours to cook. The recipe is from \"Culinária Portuguesa\". As for the garlic and parsley butter, it's a family recipe and it's incredibly good. In potatoes, on top of a steak, it doesn't matter. It's just good.\r\n/div\r\n\r\n\r\n\r\nh3Ingredients (span class=\"yield\"6 servings/span)/h3\r\n\r\r\nuFor the Braised Beef/u:\r\r\n\r\r\n1kg stewing beef \r\r\n2 medium onions\r\r\n2 red peppers \r\r\n3 tomatoes \r\r\n2 garlic cloves\r\r\n1 bay leaf\r\r\nbunch fresh parsley\r\r\n3dl (1 1/4 cups) white wine\r\r\n1 tablespoon vinegar\r\r\n1dl (1/3 cup) olive oil\r\r\nbacon, salt, pepper q.s.\r\r\n\r\r\nuFor the Garlic Butter Potatoes/u:\r\r\n\r\r\n125g (1 stick) butter\r\r\n2 garlic cloves\r\r\npotatoes, salt, fresh parsley q.s.\r\r\n\r\r\n\r\nh3Instructions (Time: span class=\"duration\"2 hours/span)/h3\r\n\r\r\nStart by larding the beef with bits of bacon. I don't have a larding needle, and as such, I made small cuts on the beef and pushed the bits of bacon in. In a big pot place the onions and the olive oil. Punch the garlic cloves, de-seed the red peppers, slice them in four and place them in the pot. De-seed the tomatoes, slice them in four and place them in the pot too. Chop the parsley and add it to the pot. Add the bay leaf and place the beef on top. Season with salt and pepper, and add the white wine and the vinegar. Cover the pot and cook for 1h45 to 2h or until the beef is done and the sauce no longer tastes like wine.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\n  \r\r\n\r\r\nAs for the potatoes, bake in the oven for 40 minutes at 200ºC (390ºF) or until they're done. While they're baking, if you have a food processor, place the garlic, the parsley and the butter in the bowl and process until everything is mixed. If you don't have a food processor, finely chop the parsley, finely chop the garlic (or use a garlic press) and mix with softened butter. Place in the fridge until you're ready to serve.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n  \r\r\n\r\r\nYou can use the garlic butter later on top of a steak for instance.  \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nSlice the potatoes halfway through and place a teaspoon of butter inside the potato. And serve.  \r\r\n\r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "garlic",
            "portuguese",
            "beef",
            "butter",
            "potatoes",
            "portugueseculinary"
        ]
    },
    {
        "uri": "/2012-08-10-chicken-fricassee",
        "title": "Chicken Fricassee",
        "content": "div class=\"description\" hidden\r\nI had never had Chicken Fricassee until now. Not that there's anything special about the way the chicken is cooked, but the sauce was extraordinary. The butter, the bits of chicken that are left behind and the mushrooms are brought together by the egg yolks resulting in a creamy and tasty sauce. I used a recipe from a href=\"{{< relref \"/pantagruel.md\" }}\"\"Pantagruel\"/a.\r\r\n/div\r\n\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"4 servings/span)/h3\r\n\r\r\n1 carved chicken or some whole legs and thighs\r\r\n2 tablespoons butter\r\r\n1 heaped teaspoon of flour\r\r\n100g (3.5oz) sliced mushrooms \r\r\n3dl (1 1/3 cups)chicken stock\r\r\n2 egg yolks\r\r\n2 bay leaves \r\r\nparsley, salt, pepper q.s.\r\r\n\r\nh3Instructions (Time: span class=\"duration\"1 hour/span)/h3\r\n\r\r\nStart by frying the chicken in the butter until it turns golden. Add the flour and mix.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAdd the chicken stock and afterwards, add the mushrooms and season with salt, pepper and the bay leaves. Let it cook in low heat.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nWhen the chicken is done, and you're ready to serve, it's time to make the sauce. Remove the chicken from the pot. Dissolve the egg yolks in 2dl of water (the recipe called for more chicken stock but it was already well season, and I decided to use water instead), add it to sauce, bring to a simmer and mix without stopping. Remove from the heat before it boils.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\n  \r\r\n\r\r\nGarnish with parsley and serve.\r\r\n\r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "mushrooms",
            "chicken",
            "french"
        ]
    },
    {
        "uri": "/2012-08-14-chocolate-semifreddo",
        "title": "Chocolate Semifreddo",
        "content": "\r\ndiv class=\"description\" hidden\r\nToday I'll share my favorite dessert as a kid. Perhaps it still is, but now I have to make it. Twenty years ago, my mum came up with the idea and it soon became a classic at my parent's restaurant (no longer in existence). It is, quite simply, frozen cream enveloped in frozen chocolate mousse, surrounded by melted chocolate. The outside chocolate remains soft, in contrast with the firmer interior, in a perfect blend of texture and sweetness.\r\r\n/div\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"12 servings/span)/h3\r\n\r\r\n8 eggs\r\r\n8 + 2 tablespoons sugar\r\r\n200g (7oz) dark chocolate\r\r\n2 tablespoons butter\r\r\n5 gelatin sheets\r\r\n400mL (1 2/3 cup) cream\r\r\ndark chocolate q.s.\r\r\n\r\r\n\r\nh3Instructions (Time: span class=\"duration\"7 hours/span)/h3\r\n\r\r\nStart by melting the chocolate with the butter. While the chocolate melts, soften the gelatin sheets in some cold water. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nBeat 8 tablespoons of sugar with the egg yolks until it turns into a pale mixture.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAfter the chocolate is melted, dissolve the gelatin the sheets in the chocolate (and add 1 or 2 tablespoons of water if it's too hard).\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAdd the melted chocolate with the gelatin to the egg yolk mixture and mix well. Beat the egg whites until stiff and fold them in the chocolate mixture.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nPlace the mixture in a recipient that can go to the freezer (I used a plastic container because it is easy to unmold afterwards). Place on the freezer for 3 hours.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nMark the container's shape 2cm (1in) from the outside with a knife. With a spoon remove the chocolate from the inside and keep for later.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nBeat the cream with two tablespoons of sugar and place it inside the shell you created. Place on the freezer for about 1 hour.\r\r\n\r\r\nPlace the remaining chocolate on top of the whole semifreddo and place on the freezer for 2 hours more.\r\r\n\r\r\nTo unmold, use a knife to separate the semifreddo from the container, place it upside down on a serving platter and let gravity do its job. You might need to help it by spreading the container. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\nMelt some chocolate and serve!\r\n\r\n\r\r\n\r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "chocolate",
            "icecream"
        ]
    },
    {
        "uri": "/2012-09-11-butter-cookies",
        "title": "Butter Cookies ",
        "content": "\r\ndiv class=\"description\" hidden\r\nSo last week I was looking through my cookbooks trying to figure out what to bake the next day, when I came across these cookies. They were super simple to make. Delicate and delicious - the kind of cookies that melt in your mouth. And perfect to go with a cup of tea. This recipe is adapted from \"Culinária Portuguesa\".\r\r\n/div\r\n\r\n\r\n\r\nh3Ingredients (span class=\"yield\"10 cookie sandwiches/span)/h3\r\n\r\n60g (half stick) butter at room temperature\r\n2 level tablespoons sugar \r\r\n1 egg\r\r\n100g (3/4 cup + 1 tablespoon) flour\r\r\n2 teaspoons baking powder \r\r\nraspberry jam q.s.\r\r\n\r\nh3Instructions (Time: span class=\"duration\"45 minutes/span)/h3\r\n\r\nMix everything together making sure that the butter is well mixed in the dough. If you don't have a pastry bag, add more flour if the dough is too runny - this way you can roll out the dough and cut the cookies with a cookie cutter (as the original recipe intended).\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nIf you do have a pastry bag, make small cookies in the shape that you like. Bake in a preheated oven to 220ºC (430ºF), until they turn golden (which should take about 6 minutes).\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAllow to cool, spread a small amount of jam on one cookie and \"glue\" two cookies together. \r\r\n\r\r\nAnd serve.\r\r\n\r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "portuguese",
            "butter",
            "cookies",
            "portugueseculinary"
        ]
    },
    {
        "uri": "/2012-09-14-siam-pumpkin-jam-and-almond-tart",
        "title": "Siam Pumpkin Jam and Almond Tart",
        "content": "div class=\"description\" hidden\r\nToday's recipe is another Portuguese classic. It's my mum's recipe that my sister wrote down a few years ago (and good thing she did because my mother no longer has it). I have been wanting to try it for a long time, but I can't seem to find a href=\"http://en.wikipedia.org/wiki/Cucurbita_ficifolia\"siam pumpkin/a jam in Denmark. So I brought a jar of jam with me from Portugal. This jam has a very distinctive savor and, although I wouldn't spread it on a slice of bread, when together with almonds and orange it has incredible flavor. The acidity of the orange complements the sweetness of the jam and it's just amazing.\r\n/div\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"12 servings/span)/h3\r\n\r\r\n6 egg yolks\r\r\n3 egg whites\r\r\n230g (1 cup and 2 tablespoons) sugar\r\r\n175g (6oz) siam pumpkin jam\r\n250g (8.5oz) pealed almonds \r\r\nzest of half an orange\r\r\npowdered sugar q.s.\r\r\n\r\nh3Instructions (Time: span class=\"duration\"1 hour/span)/h3\r\n\r\nStart by grinding the almonds coarsely. Grease a tart tin with butter and sprinkle some flour on top. You should use a tart tin with a removable bottom. I don't have one, so I placed a greased parchment paper on the bottom, just to be safe.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nBeat the egg yolks with the sugar until it turns pale.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nNow it's time to add the Siam Pumpkin jam - we call it \"doce de gila\". This pumpkin is quite common in Portugal, but I can't find it here in Denmark. I brought some with me from Portugal the last time I was there. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAdd the almonds, the jam and the zest of orange and mix well. Beat the egg whites into stiff peaks and fold them in the mixture.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nPlace the mixture in the tart tin and bake in a preheated oven to 200ºC (390ºF) for 45 minutes (30 minutes in, I covered the tart with aluminium foil because it had already reached the color that I was looking for). Keep in mind that it is supposed to be quite dark. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nLet it cool down and unmold the tart. Sift some powdered sugar on top and serve!\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "portuguese",
            "tart"
        ]
    },
    {
        "uri": "/2012-10-03-tagliatelle-bolognese",
        "title": "Tagliatelle Bolognese",
        "content": "\r\ndiv class=\"description\" hidden\r\nWhenever I make bolognese sauce, I usually use my own recipe that is probably miles away from the real deal. I call it bolognese because it basically has minced meat and tomato sauce. I've looked at recipes of \"real\" bolognese and they generally include celery and carrot. When I realized that a href=\"{{< relref \"/pantagruel.md\" }}\"\"Pantagruel's\"/a recipe included those ingredients, I decided to give it a try it. The taste was definitely different from what I had ever tasted and I do hope to do justice to the original Italian recipe. But it was good regardless!\r\r\n/div\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"4 servings/span)/h3\r\n\r\r\n250g (1/2 pound) minced beef \r\r\n50g (1.7oz) prosciutto (I used bacon instead)\r\r\n1 carrot\r\r\n1 onion\r\r\n1 stick celery\r\r\n2 tablespoon of butter\r\r\n2 tablespoons of red wine\r\r\n1 teaspoon of flour\r\r\n1 teaspoon of sugar\r\r\n200g (7oz) canned tomatoes (without seeds and peeled)\r\r\n1 bunch parsley\r\r\ntagliatelle, olive oil, cloves, nutmeg, pepper, salt q.s.\r\r\n\r\r\n\r\nh3Instructions (Time: span class=\"duration\"1.5 hours/span)/h3\r\n\r\r\nFinely chop the celery, the carrot, the prosciutto and the onion. Drizzle some olive oil on the bottom of a pot and cook the meat in low heat with the chopped vegetables and prosciutto. If it gets too dry add a bit of water (by the way, the photos are from double the recipe).\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nWhen the meat has gained some color, add the flour, the tomatoes in small pieces, the sugar and the parsley. Keep mixing until it dries out a bit. Add the wine diluted with a tablespoon of water and season with salt, nutmeg, cloves, and pepper. Put the lid on and let it cook in low heat. When the mixture has thickened, taste for salt and beat the butter in. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\n  \r\r\n\r\r\nCook the tagliatelle and serve!\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "beef",
            "italian"
        ]
    },
    {
        "uri": "/2012-10-22-carrot-walnut-cake",
        "title": "Carrot Walnut Cake",
        "content": "\r\ndiv class=\"description\" hidden\r\nAnd now for a very simple but delicious cake. The cake's recipe is from an aunt of mine and I decided to spruce it up a bit with an orange glaze. a href=\"{{< relref \"/pantagruel.md\" }}\"\"Pantagruel\"/a has several recipes for glazes, and orange+carrot seemed a great combo. It was. \r\r\n\r\r\nOn a side note, can you tell that the light in Denmark has already started to change? From now until April I guess I'm going to have to start prepping dinner at 2pm if I want to shoot with natural light. :)\r\r\n\r\n/div\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"12 servings/span)/h3\r\n\r\r\nuFor the Cake/u\r\r\n\r\r\n(I used a mug to measure the ingredients)\r\r\n\r\r\n2 cups of flour\r\r\n2 cups of sugar\r\r\n1 cup of walnuts \r\r\n2 big carrots\r\r\n8 eggs\r\r\n1 teaspoon baking powder\r\r\n\r\r\nuFor the Glaze/u\r\r\n\r\r\n2 tablespoons of butter at room temperature\r\r\n6 tablespoons of orange juice \r\r\nzest of one orange\r\r\nicing sugar q.s.\r\r\n\r\r\nh3Instructions (Time: span class=\"duration\"1.5 hours/span)/h3\r\n\r\r\nStart by beating the egg yolks with the sugar until it turns pale. Shred the carrots and add it to the mixture.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAdd the flour and the baking powder and mix. Chop the walnuts and beat the egg whites until soft peaks form. Fold the egg whites in the cake batter together with the chopped walnuts.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nGrease and flour a cake tin and bake in a preheated oven to 180ºC (350ºF) for 25-35 minutes (check if it's done with a toothpick). As for the orange glaze, beat the butter with the zest of the orange until it's creamy. Add some icing sugar until you have a consistent mixture. Finally, add the orange juice and if it is too fluid, add more icing sugar or if it is too thick, add more orange juice! (Someone forgot to take photos of the glaze lol)\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\nWait until the cake has cooled down a bit and spread the glace on top. \r\n  \r\r\n\r\r\n\r\r\n\r\r\nAnd serve!\r\n\r\r\n\r\n\r\r\n\r\n",
        "tags": [
            "walnut",
            "carrot",
            "cake",
            "glaze"
        ]
    },
    {
        "uri": "/2012-11-07-portuguese-rice-pudding",
        "title": "Portuguese Rice Pudding ",
        "content": "div class=\"description\" hidden\r\nI keep introducing Portuguese recipes as \"classic\"/\"traditional\", but lets face it, Portuguese Rice Pudding is a Portuguese classic. It's on our tables at birthday parties, Christmas and any other occasion. This one is my mom's recipe and is a very simple recipe. Some people use vanilla or even some sort of flan to give it a more structured texture, but I prefer this version. It's creamy and delicious. I hope you enjoy it.\r\r\n/div\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\r\nh3Ingredients (span class=\"yield\"10 servings/span)/h3\r\n\r\r\n1L (4 1/2 cups) milk\r\r\n300g (1 1/2 cups) sugar\r\r\n300g (1 1/2 cups) short grain rice\r\r\n2 lemon peels (not the peel of two lemons, just two peels of one lemon cut vertically)\r\r\n4 egg yolks\r\r\ncinnamon q.s.\r\r\n\r\r\n\r\nh3Instructions (Time: span class=\"duration\"4 hours/span)/h3\r\n\r\r\nCook the rice with enough water to cover it with a bit of salt until it is nearly done. Mix the milk with the sugar and the lemon peels and heat it in a pot. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nBeat the egg yolks and add a little of the warmed milk to the egg yolks. Add the egg yolks and the rice to the milk. Let it cook in low heat until it thickens (I like it more on the thick side, but if you prefer it thinner just remove it sooner).\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nPlace it on a serving bowl and let it cool down. Once it has reached room temperature, place it in the fridge for 2h/3h. Sprinkle some cinnamon on top and serve!\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\n\r\n\r\n",
        "tags": [
            "rice",
            "portuguese",
            "cinnamon"
        ]
    },
    {
        "uri": "/2012-11-12-broas-do-bolinho",
        "title": "Broas do Bolinho",
        "content": "div class=\"description\" hidden\r\nNow this is a first. I couldn't find an appropriate title in English for this post so there you go, good old Portuguese. We don't really celebrate Halloween in Portugal. Instead, on the 1st of November, children wake up early in the morning and go door-to-door asking for iBolinho/i or a href=\"http://en.wikipedia.org/wiki/P%C3%A3o-por-Deus\"iPão-por-Deus/i/a - basically they get treats that can be in the form of these rolls I'm sharing today, chocolates, money or even walnuts/chestnuts if you're terribly unlucky. I'm not 100% certain they do this in the big cities, but I sure got to do it in Leiria and I loved it. \r\r\n\r\nThe 1st of November is celebrated differently depending on the region you are from. For instance, if you're from the North of Portugal you might remember the dead on this day. However, in Center Portugal it's all about the treats for the children. As for the catholic adults, in some villages, you can leave flowers on your door as a symbol that you welcome a priest to come in your home and give you and your family a blessing (and get some cake and wine!). Or at least that's what used to happen 18 years ago. \r\r\n\r\nAs for the recipe, it's from an aunt of mine who is known for baking the very best \"broas\", in the village she lives in. This was the first time that I tried baking these and they were kind of amazing. You might think that 1kg of flour is a lot, but you can freeze them and reheat them in the oven later, and I promise they will remain just as good. Also, the recipe calls for baker's yeast, but they don't need proving!\r\r\n\r\n/div\r\n\r\r\n\r\r\n  \r\r\n\r\r\nh3Ingredients (span class=\"yield\"9-10 buns/span)/h3\r\n\r\r\n1kg (8 1/3 cups) flour\r\r\n400g (1 2/3 cups) water \r\r\n375g (a little less than 2 cups) sugar\r\r\n125g (1 stick) butter\r\r\n100g (3.5oz) raisins\r\r\n100g (3.5oz) walnuts\r\r\n25g (0.9oz) baker's yeast \r\r\n1 tablespoon cinnamon\r\r\n1/2 teaspoon baking soda\r\r\n10g (0.4oz) salt\r\r\nzest of 1 lemon\r\r\n1 egg yolk and some milk for the egg wash\r\r\n\r\r\nh3Instructions (Time: span class=\"duration\"50 minutes/span)/h3\r\n\r\r\nStart by mixing the flour, the sugar, the raisins, the walnuts, the cinnamon, the baking soda and the zest of the lemon. Melt the butter and add to the dough. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nDissolve the yeast in a bit of lukewarm water and add it to the dough. Measure the necessary lukewarm water and dissolve the salt in it. Add it to the dough and mix just until the dough comes together. You should end up with a fairly tough dough.\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nShape the dough into rolls and brush them with a egg wash. Bake in a preheated oven to 200ºC (390ºF) until they're golden (~25 minutes).\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAnd serve! They're great on their own but you can also have them with a bit of butter.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "rolls",
            "portuguese",
            "special occasion",
            "bread"
        ]
    },
    {
        "uri": "/2012-11-21-apple-flan",
        "title": "Apple Flan",
        "content": "div class=\"description\" hidden\r\nI talked a href=\"{{< relref \"2012-11-12-broas-do-bolinho.md\"}}\"raisins and nuts/a last week and it wouldn't be right to skip cooking something with apples this autumn. Whenever I'm out of ideas for new recipes I just pick a href=\"{{< relref \"/pantagruel.md\" }}\"\"Pantagruel\"/a and look for inspiration. This recipe seemed simple enough and, more importantly, the main focus was on apples. The recipe called for a href=\"http://en.wikipedia.org/wiki/Reinette\"Reinette/aapples. These apples originated in France and are oftentimes used as a cooking apples in Portugal. Unfortunately, I couldn't find them in Denmark and so I used Royal Gala instead. The result was a crunchy top, a flan like consistency on the bottom and an amazing aroma.\r\n/div\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nh3Ingredients (span class=\"yield\"10 servings/span)/h3\r\n\r\r\n100g (1/2 cup) sugar\r\r\n40g (1/3 cup) flour\r\r\n4 cooking apples\r\r\n1 egg\r\r\n2.5dl (1 cup) milk\r\r\n1 tablespoon butter (plus more butter for the baking dish)\r\r\n1/4 teaspoon vanilla sugar \r\r\n\r\r\nh3Instructions (Time: span class=\"duration\"1 hour/span)/h3\r\n\r\r\nGrease a baking dish with some butter. Wash your apples (I used Royal Gala but you can use other type of cooking apples).\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nPeel the apples, slice them in four and put them in some fresh water with a few drops of lemon. Finely slice the apples and place them on the bottom of the baking dish. I used a food processor and that is why it looks a bit messy, but I actually like how it came out in the end.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nDissolve the flour in the milk, add the egg and the vanilla and spread on top of the apples. Spread the sugar on top of everything.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nCut the butter in tiny bits and place it on top of the sugar. Bake in a preheated oven to 160ºC (320ºF) until it turns golden.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nServe warm or cold with a good cup of tea.\r\r\n\r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "apple",
            "pantagruel"
        ]
    },
    {
        "uri": "/2012-11-26-basic-white-bread",
        "title": "Basic White Bread",
        "content": "div class=\"description\" hidden\r\nI have been playing around with a bread recipe for two months now. Since we only eat bread on our cheat day (we're on paleo), it took a while to get it to where I wanted it to. Bread in Denmark is remarkably different from the bread in Portugal and we find ourselves craving for something authentic, from time to time. A few years ago, my dad gave me a recipe for bread that could be tweaked to what I was looking for in a loaf of bread, with a range of possible percentages for flour and yeast instead of quantities.  \r\r\nThe husband is very particular in regard to what kind of bread he likes: it has to be light, with small air holes, a slight bitter taste and a soft crust. After a lot of experimentation, I finally discovered the combination that would result in that type of bread: white but strong flour, steam in the oven for a soft crust, overnight proving for bitter taste and a smaller second proving for small air holes. And that is the recipe that I'm sharing today!\r\n/div\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nh3Ingredients (span class=\"yield\"1 loaf/span)/h3\r\n\r\r\n500g (4 1/3 cups) strong white flour (check note)\r\r\n350g (12.35oz) cold water\r\r\n10g (0.35oz) salt\r\r\n20g (0.7oz) baker's yeast\r\r\n\r\r\nuNote/u: The flour plays an important role in the way your bread will look and how it will taste. I used a T55 type of flour considering the Portuguese nomenclature. In Denmark, they identify the flour by the percentage of protein - in this case 12%. You can check here for different kinds of flour and how to identify them. Also, keep in mind that if you want a darker bread you should use a stronger flour (or a combination of two kinds).\r\n\r\nh3Instructions (span class=\"duration\"6 hours/span)/h3\r\n\r\r\nStart by crumbling the yeast in the flour with your hands. Dissolve the salt in the water and add it to the flour and yeast.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n  \r\r\n\r\r\nMix well and now it's time to work the dough. If kneading the dough by hand, it might take you 15-20 minutes. You want an elastic dough that doesn't break when pulled. Because you're using 70% water, the dough will be a bit wet and it will seem unmanageable at first. But it will soon become easier and it won't stick to your hands as much. Once you're done kneading, cover the bowl with a kitchen towel and let it prove in the fridge overnight, or leave it out for 3-4 hours (or until it doubled in size). I like to keep it overnight so that it can acquire a sightly bitter taste.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n  \r\r\n\r\r\nThe next day (or a few hours later), shape the dough and let it rise in a floured oven tray, until it has doubled in size. If you left the dough in the fridge overnight, it will take a while to get to room temperature and rise accordingly. Mine took about an hour. Cutting the dough on top is optional. Place a baking tin on the bottom of the oven with water, and bake in a preheated oven to 230ºC (450ºF) for 15 minutes, lower the temperature to 200ºC (400ºF) and bake for 30-40 minutes (the steam from the water will make the crust softer).\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nTo check if the bread is baked properly, tap the bottom of the loaf and look for a hollow sound. Let it cool down before slicing it.\r\r\n\r\r\n \r\n\r\n\r\r\n  \r\r\n\r\r\nServe and enjoy your homemade loaf of bread.\r\r\n\r\r\n  \r\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "portuguese",
            "bread"
        ]
    },
    {
        "uri": "/2012-12-08-bacalhau-with-broa",
        "title": "Bacalhau with Broa",
        "content": "div class=\"description\" hidden\r\nIn the spirit of this Christmas season, here is a recipe worthy of a Christmas dinner in Portugal. a href=\"http://en.wikipedia.org/wiki/Bacalhau\"iBacalhau/i/a, or codfish that has been salted and dried, is commonly eaten on Christmas Eve in Portugal, roasted or boiled accompanied by cabbage or potatoes. My sister and my brother-in-law came to visit us recently and brought us two essential ingredients: ibacalhau/i and a href=\"http://en.wikipedia.org/wiki/Broa\"ibroa/i/a (a special kind of cornbread). It's possible to find bacalhau in Denmark, but broa is nearly impossible, I'd say. I will be going to Portugal for Christmas and I will try to find a reliable recipe for broa, so that you can give this a try wherever you are. \r\r\n\r\r\nThe obscene amounts of olive oil and the garlic make for a recipe that might be a bit too much for non-Portuguese folks, but all I can say is that we ate 800g of codfish for lunch. No regrets. It was amazing. And the recipe is from an aunt of mine.\r\r\n\r\r\n/div\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nh3Ingredients (span class=\"yield\"4-5 servings/span)/h3\r\n\r\r\n4 bacalhau (dried and soaked codfish) pieces (200g/7oz each)\r\r\n10 garlic cloves\r\r\n1/2 broa (cornbread)\r\r\nolive oil, salt, chili pepper flakes, q.s.\r\r\n\r\r\n/h3Instructions (Time: span class=\"duration\"1 hour/span)/h3\r\n\r\r\nBroa might be the most difficult ingredient to get for this recipe. I've never made broa and from what I've heard it's somewhat difficult. I will try to make it and I'll share the recipe at a later time. Chop the broa with a food processor if you have one or with your hands.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nIt will crumble to pieces. Add some olive oil (~2 tablespoons), the garlic, a bit of salt and a bit of chili pepper flakes.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nPlace the bacalhau on a baking tray. Just look at these beautiful pieces of bacalhau.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nPress the broa mixture on top of the bacalhau and don't worry if it falls in the baking tray. Pour olive oil in the baking tray until it reaches 1/3 of the pieces. Bake in a preheated oven to 200ºC (390ºF) for 40 min (I lowered the temperature to 180ºC (350ºF) for the last 10 minutes because the broa was getting too dark).\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nServe with punched potatoes or with some boiled cabbage.  \r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "bacalhau",
            "portuguese",
            "christmas",
            "codfish"
        ]
    },
    {
        "uri": "/2012-12-12-filhoses",
        "title": "Filhoses",
        "content": "div class=\"description\" hidden\r\nI've shared a recipe for a href=\"{{< relref \"/recipes/2012-12-08-bacalhau-with-broa.md\"}}\"bacalhau/a (salted and dried codfish), but no Portuguese Christmas dinner is complete without a href=\"http://en.wikipedia.org/wiki/Filh%C3%B3s\"ifilhoses/i/a (or ivelhoses/i). Or at least this is true for Center Portugal. iFilhoses/i can be made of pumpkin or of carrots. In my family however we only make carrot ifilhoses/i. Both my grandmothers use carrots and this is the recipe of one of them. They never really measured their ingredients, but this is a close approximation that an aunt of mine came up with, after watching my grandmother. \r\r\n/div\r\n  \r\r\n\r\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"20-24 ifilhóses/i/span)/h3\r\n\r\r\n1kg (35oz) carrots\r\r\n250g + 4 tablespoons (2 1/3 cups) flour\r\r\n4 tablespoons sugar\r\r\n3 eggs\r\r\n1 orange \r\r\n1 teaspoon baking powder\r\r\nsugar and cinnamon in equal quantities, oil, q.s.\r\r\n\r\r\nh3Instructions (Time: span class=\"duration\"1 hour/span)/h3\r\n\r\r\nPeel the carrots and grate them finely. Add the zest of the orange to the carrots. Dissolve the sugar in the juice of the orange and add it to the mixture. Add the eggs and the baking powder and mix well.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAdd the flour and mix well. You want the dough to be slightly dense so that when you drop it from a spoon it falls in one piece. Add more flour if necessary.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nYou want to use half a tablespoon for each filhós.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nHeat up some oil and fry one filhós to make sure the oil is hot enough. You can fry several filhoses at once. When you're frying the dough, it should turn on itself. But if it doesn't, just give it a little help with a tablespoon. Remove the filhós when it turns golden on both sides. Place them on a paper towel to remove excess oil and cover them with the cinnamon and sugar mixture.\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\nLet it cooldown and serve.\r\n\r\n\r\n\r\n\r\n",
        "tags": [
            "portuguese",
            "christmas"
        ]
    },
    {
        "uri": "/2013-02-07-valentines-day-cinnamon-cookies",
        "title": "Valentine's Day Cinnamon Cookies",
        "content": "\r\ndiv class=\"description\" hidden\r\nValentine's Day is almost here and I just had to make something in the shape of an heart. Last year was a href={{< relref \"/life/2012-02-14-happy-valentines-day.md\" }}breakfast/a, but this year I made cinnamon cookies. \r\r\n\r\r\nLast Christmas I got a classic Portuguese cookbook called \"Cozinha Tradicional Portuguesa\" by Maria de Lourdes Modesto. It has amazing detailed recipes from all over the country and it even has some pictures (as opposed to Pantagruel). This is the third recipe that I've tried from this book and it turned out even better than I was expecting. These cookies are called Raivas and are from a Portuguese city called Aveiro. They usually take an abstract form, but you can shape them in any form you feel like, hearts included.\r\n /div\r\n \r\n\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"24 cookies/span)/h3\r\n\r\r\n3 eggs\r\r\n100g sugar (or 1/2 cup)\r\r\n250g flour (or 2 cups and 1 tablespoon)\r\r\n75g butter (or 2/3 stick)\r\r\n1 teaspoon cinnamon\r\r\n\r\r\nh3Instructions (Time: span class=\"duration\"/span50 minutes/span)/h3\r\n\r\r\nStart by mixing the sugar with the butter. Add the eggs one by one. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nOnce you've added all the eggs, mix in the flour and cinnamon previously sifted. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nShape the cookies and don't be afraid to use flour so that the dough doesn't stick to your hands. If you want to make heart shaped cookies, start by making a long string with the dough and curl each end of the string.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAnd there you go. Try to make the cookies all the same size otherwise the thinner ones will get brown too quickly. Bake in a preheated oven to 200ºC (390ºF) (if you can't turn off your oven fan, reduce the temperature to 180ºC (350ºF)) until golden.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nGoes great with coffee!  \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "portuguese",
            "cozinhatradicionalportuguesa",
            "cinnamon",
            "cookies"
        ]
    },
    {
        "uri": "/2013-02-25-almond-squares",
        "title": "Almond Squares",
        "content": "div class=\"description\" hidden\r\nAlmond Tart is a staple at my grandparents for every party/celebration. The recipe that my aunts use is more of a cake than a tart. But I wanted to try something knew and as it turns out a tart base is just as good. \r\r\n\r\nThis tart contains extraordinary amounts of butter and a crunchy top. It's great on it's own or even better when accompanied by some vanilla ice cream. The recipe is from Cozinha Tradicional Portuguesa.\r\r\n/div\r\n  \r\r\n\r\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"6 squares/span)/h3\r\n\r\r\nuFor the dough:/u\r\r\n\r\r\n200g flour (or 1+2/3 cups)\r\r\n100g butter (or a little less than 1/2 cup)\r\r\n200g sugar (or 1 cup)\r\r\n2 eggs\r\r\n\r\r\nuFor the filling:/u\r\r\n\r\r\n100g sugar (or 1/2 cup)\r\r\n100g butter (or a little less than 1/2 cup)\r\r\n125g pealed and slivered almonds (or 4.4oz)\r\r\n0,5dl milk (or a little less than 1/4 cup)\r\r\n\r\r\nh3Instructions (Time: span class=\"duration\"1 hour/span)/h3\r\n\r\r\nuFor the dough:/u\r\r\n\r\r\nSift the flour to your counter top. Add the sugar and make a well in the middle. Add the eggs and the butter cut into small pieces. Work the dough for a bit until all the ingredients are mixed.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nPlace the dough in a tart tin and bake in the oven at 200ºC (390ºF) until it turns golden (~15 minutes).\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nLet it cool down a bit while you make the filling.\r\r\n\r\r\nu  \r\r\n/u\r\r\n\r\r\nuFor the filling:/u\r\r\n\r\r\nMix the almonds with the sugar, the butter and the milk in a pan. Bring to a boil and keep stirring until it thickens. Spread on top of the base and place in the oven at 220ºC (430ºF) until it turns golden.  \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nLet it cool down before removing from the tin. Serve as a tart or cut it into squares and serve with some vanilla ice cream. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "almonds",
            "cozinhatradicionalportuguesa",
            "tart"
        ]
    },
    {
        "uri": "/2013-03-17-roasted-pork-carre",
        "title": "Roasted Pork Carré",
        "content": "\r\ndiv class=\"description\" hidden\r\nI grew up eating pork carré occasionally and was truly surprised when I found this meat cut here in Denmark, even though carré doesn't sound Portuguese at all. And with a recognizable name! (iSvine carré/i). I made some changes to a recipe from Culinária Portuguese and it worked perfectly. It is a moist pork roast and I think the fat on top helps to give it flavor. This recipe followed a series of mishaps in the last month, so I was more than happy with how wonderful this roast turned out.\r\n/div\r\n  \r\r\n\r\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"4 servings/span)/h3\r\n\r\r\n1,5kg pork carré (or 3.3lbs)\r\r\n3 garlic cloves\r\r\n3 onions\r\r\n1 sage leaf\r\r\n1 lemon\r\r\n2dl white wine (or 3/4 cup)\r\r\nolive oil, salt, pepper q.s.\r\r\n\r\r\nh3Instructions (Time: span class=\"duration\"90 minutes/span)/h3\r\n\r\r\nPlace the garlic cloves grossly chopped, the onions sliced in 4, the bay leaf and some olive oil on the bottom of a baking dish. Lay the pork carré on top of the onions with the bones down. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nSeason with salt and pepper, squeeze the lemon on top of the meat and pour the wine on the bottom of the baking dish.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nRoast for ~1h20 in a preheated oven to 180ºC (355ºF) basting every 20 minutes. I know it sounds like a daunting task, but you'll end up with a succulent chunk of meat. Remove from the oven and let it rest for 10 minutes, covered in aluminium foil, before carving.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "roast",
            "portuguese",
            "pork",
            "portugueseculinary"
        ]
    },
    {
        "uri": "/2013-03-30-easter-bread-ii",
        "title": "Easter Bread II",
        "content": "div class=\"description\" hidden\r\nI hope you're having a nice Easter. Last year I shared a a href=\"{{< relref \"/recipes/2012-05-01-easter-bread.md\"}}\"recipe/a from a href=\"{{< relref \"/pantagruel.md\" }}\"\"Pantagruel\"/a for a traditional Portuguese Easter bread, but I completely failed its presentation. So this year I decided to try a new recipe and this time from \"Cozinha Tradicional Portuguesa\". And I'm glad I decided to give it a try because I actually prefer this version. \r\r\n\r\r\nThe egg in the middle is completely optional. I've never in my life ate the boiled egg. And there's something about the cross on top of Easter buns. I'm not sure what it represents, but I've seen it all over the internet this week and the Portuguese version is no exception.\r\r\n\r\r\n/div\r\n  \r\r\n\r\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"2 loaves/span)/h3\r\n\r\n500g flour (or 4 1/4 cups)\r\r\n100g butter (or 1/2 cup)\r\r\n15g fresh yeast (or 0.5oz)\r\r\n3 tablespoons sugar\r\r\n2 small eggs\r\r\n2,5dl milk (plus a little more to dissolve the yeast) (or 1 cup and 1 tablespoon)\r\r\n1 teaspoon salt\r\r\n1 teaspoon cinnamon\r\r\n1 teaspoon fennel seeds chopped or powdered\r\r\n2 boiled eggs (optional)\r\n\r\nh3Instructions (Time: span class=\"duration\"4 hours/span)/h3\r\n\r\nStart by dissolving the yeast in a bit of warm milk. Add 100g (1 cup) of flour (out of the total weight) and 1 tablespoon of sugar (also out of the total amount of sugar). Leave the dough to rise covered for 20 minutes in a warm place.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\n  \r\r\n\r\r\nIn a big bowl, mix the flour, the eggs, the sugar and the milk. Work the dough for a few minutes.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nAdd the melted butter, the salt, the cinnamon, the fennel and the yeast dough. Mix well until the dough no longer sticks to your hands nor to the bowl.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nLet it rise covered for 2-5hours depending on the place you leave it (my kitchen was warm and it took about 3h30). Once is has doubled in size, divide the dough in two parts. Leave a bit of dough from each part to later make the cross. Form round loaves and place them in a floured baking tray.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nFlatten their surface a little and place the boiled eggs on top (optional). Form four strips with the remaining dough and place them on top of the eggs. Brush the loaves with a egg wash and bake in a preheated oven to 210ºC (410ºF) (fan off) until the loaves are golden (about 20 minutes). Let it cool down before serving.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "portuguese",
            "special occasion",
            "cozinhatradicionalportuguesa",
            "easter",
            "bread"
        ]
    },
    {
        "uri": "/2013-06-11-apple-tarts",
        "title": "Apple Tarts",
        "content": "\r\ndiv class=\"description\" hidden\r\nSo it has been a while! And here I am with probably the longest post so far. But for a very good reason: a new and improved puff pastry for tarts recipe (a href=\"{{< relref \"/recipes/2012-07-10-portuguese-egg-tarts-pastel-de-nata-part-ii.md\" }}\"here/a is the old one) and some delicious apple tarts. The husband loves these tarts. We had some the last time we were in Portugal, which naturally prompted me to answer the question: can I make this at home? Well I can and so can you. Yes it takes forever, but I think it's totally worth the effort. Plus, if you don't feel like making the puff pastry yourself, you can always use the store bought kind.\r\nI got the recipe for the puff pastry from \"Cozinha Tradicional Portuguesa\", as part of the Portuguese egg custard recipe (which I plan to try in the near future). It is definitely better than the one from a href=\"{{< relref \"/pantagruel.md\" }}\"\"Pantagruel\"/a that I shared before, that's for sure. The pastry cream was from \"Pantagruel\" and everything else was common sense. I believe the apple tarts you find in Portugal are shinier because they use some sort of special glaze. Unfortunately I couldn't find it in Denmark and had to improvise!\r\n/div\r\n\r\n\r\r\n\r\nh3Ingredients (span class=\"yield\"8-10 tarts/span)/h3\r\n\r\nuFor the puff pastry/u:\r\r\n\r\r\n250g flour (or 2 cups and 1 heaped tablespoon)\r\r\n250g butter (or 1 cup and 1 tablespoon)\r\r\n1-1.5dl lukewarm water (or a little over 1/3 cup to a little less than 2/3 cups)\r\r\n3g salt (0.11oz)\r\r\n\r\r\nuFor the pastry cream/u:\r\r\n\r\r\n38g flour (or 1/3 cup)\r\r\n100g sugar (or 1/2 cup)\r\r\n250ml milk (or a little over 1 cup)\r\r\n3 egg yolks\r\r\n1/2 teaspoon vanilla\r\r\n\r\r\nuFor the tarts/u:\r\n\r\r\n2 Royal Gala apples (they don't get too soft when baked)\r\r\napricot jam\r\r\njuice of half a lemon\r\n\r\nh3Instructions (Time: span class=\"duration\"2 hours/span)/h3\r\n\r\r\nuFor the puff pastry/u\r\r\n\r\r\nStart by dissolving the salt in the lukewarm water and divide the butter in three equal parts (leaving the butter in the fridge afterwards). Place the flour on your countertop and make a well in the middle. Place the water in the well and slowly bring the flour towards the middle with a fork. If the dough is too dry add more water. Work the dough until it all comes together. Place in the fridge for 20 minutes. \r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nFlour your work surface and roll out the dough so that you have a square. Place thin slices of one third of the butter (one of the three parts you cut before), leaving a two-fingers margin around the square. Bring the bottom side up and make sure the edges of the square are overlapping.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nBring the right side to the left, making sure the edges of the square overlap. Roll out the dough again, forming a square. Place the dough and the remaining butter in the fridge for 10 minutes. Repeat the process 2 more times and your puff pastry is ready to use. Leave the dough in the fridge until you're ready to use it.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nuFor the pastry cream/u\r\r\n\r\r\nBeat the eggs with the sugar in a pan until the mixture turns pale. Add the flour mixing well.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\n  \r\r\n\r\r\nAnd then add the boiling milk. Put the pan on your stove top at a medium-low temperature and continue mixing until it boils. In the end you should have a somewhat thick mixture. Remove from the stove and add the vanilla.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nuAssembling the tarts/u  \r\r\n\r\r\nPeel the apples and slice them thinly. Temporarily place them in a bowl with fresh water and some juice from a lemon.\r\r\n\r\r\nRoll out your puff pastry until it is 3-4mm (0.12-0.16in) thick. Cut it in rectangles with the width of your apples plus nearly 1cm (0.4in) on each side. Place the puff pastry rectangles in a floured baking tray and spread some pastry cream (2 tablespoons). Place the apple slices overlapping on top of the cream, leaving  1cm (0.4in) all around the rectangle.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nBake in a preheated oven to 200ºC (395ºF) for 20 minutes or until it turns golden.\r\r\n\r\r\nThe tarts will look a little bland and that's when the apricot jam comes in to give a little shine. I used joyofbaking.com recipe, where you basically heat up some apricot jam with a tablespoon of water.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nBrush the tarts with the mixture and and they're ready!\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\nLet them cool down before serving.\r\r\n\r\r\n  \r\r\n\r\r\n\r\r\n\r\r\n  \r\r\n\r\r\n\r\n",
        "tags": [
            "apple",
            "custard",
            "cozinhatradicionalportuguesa",
            "puffpastry"
        ]
    }
]